[{"source": "ksl.com", "url": "https://www.ksl.com/article/51141385/man-found-dead-in-semi-in-tooele-county-foul-play-suspected-", "title": "Man found dead in semi in Tooele County; foul play suspected ", "author": "                                            Pat Reavy, KSL.com", "date": "Sept. 26, 2024 at 2:33 p.m.", "content": "DELLE, Tooele County — State investigators are looking into the suspicious death of a semitruck driver whose body was found inside his rig on a Tooele County on-ramp on Thursday.At about 10:15 a.m., the Utah Highway Patrol was called to invesitgate a report of a deceased man in the sleeper cab of a semi-truck stopped on the on-ramp to I-80 near Delle. The man was found by a coworker who told police that he noticed that the GPS on the man's truck was not moving and decided to go check on him, according to a statement released Thursday afternoon by the State Bureau of Investigation.\"The death is suspicious in nature and we suspect foul play. The State Bureau of Investigation will be conducting the investigation, and the county attorney has been notified,\" the agency stated.No additional information was immediately released, including why foul play is suspected.This story may be updated"}, {"source": "ksl.com", "url": "https://www.ksl.com/article/51140485/utah-tech-student-killed-2-teens-seriously-injured-in-snow-canyon-rollover", "title": "Utah Tech student killed, 2 teens seriously injured in Snow Canyon rollover", "author": "                                            Collin Leonard, KSL.com", "date": "Sept. 26, 2024 at 10:25 a.m.", "content": "IVINS, Washington County — A Utah Tech University student was killed Wednesday night when a car carrying three teenagers rolled in Snow Canyon State Park.The crash happened about 10 p.m., according to Utah State Parks spokeswoman Lindsay Higbee.Higbee said the driver, a 19-year-old man from Nevada, was going between 70 mph and 100 mph down Snow Canyon Road in a Volkswagen Jetta. Two women, both 18, from Utah, were also riding in the car.Higbee says investigators believe the vehicle rolled over, traveling around 300 feet before coming to a stop in the Lava Flow Trailhead parking lot.  A release from the Santa Clara-Ivins Fire and Rescue said responders to the accident had to use \"extraction tools\" to access the trio and initiate medical care.The Nevada man died on scene, Higbee said, and the two women were taken by medical helicopter to a hospital. No identities were released Thursday morning.There was no official report on the medical status of the two women, but their injuries were serious, according to Higbee, with one woman unconscious and another incoherent.The cause of the accident is currently being investigated by the Washington County Accident Response team.This story may be updated."}, {"source": "ksl.com", "url": "https://www.ksl.com/article/51141213/native-american-advocacy-group-hosting-utah-powwow-in-tooele", "title": "Native American advocacy group hosting Utah powwow in Tooele", "author": "                                            Tim Vandenack, KSL.com", "date": "Sept. 26, 2024 at 1:45 p.m.", "content": "TOOELE — PANDOS, a Native American advocacy group, is hosting a powwow in Tooele on Friday and Saturday.\"We're doing it as a celebration of ourselves, as a way to gather the Indigenous community and celebrate together,\" said Carl Moore, a leader in the Salt Lake City-based group. The free event, open to the public, will be held at Dow James Park, 438 W. 400 North.Friday's activities start at 6:30 p.m. and will go on until about 9:30 p.m., while Saturday's activities start at noon and will go on until about 10 p.m., with a break from about 4-5 p.m.PANDOS stands for Peaceful Advocates for Native Dialogue and Organizing Support, and the group advocates for Indigenous sovereignty and human and environmental rights. This year's annual powwow is the seventh held by the organization, and Moore expects representation from around 30-40 tribes among the dancers and drummers.\"There's a lot of tribes that will be represented,\" he said."}, {"source": "ksl.com", "url": "https://www.ksl.com/article/51141132/man-arrested-in-alleged-road-rage-shooting", "title": "Man arrested in alleged road rage shooting", "author": "                                            Pat Reavy, KSL.com", "date": "Sept. 26, 2024 at 1:03 p.m.", "content": "MILLCREEK — A man wanted in connection with a road rage shooting in Millcreek last weekend has been arrested.Kenneth Alfonzo Richardson, 33, was booked into the Salt Lake County Jail on Wednesday for investigation of shooting in the direction of a person and aggravated assault, with both counts being filed under Utah's new road rage law.On Sept. 21, Richardson, while wearing a red bandanna over his face, allegedly shot at a Toyota 4Runner near 4500 South and 1300 East, according to a police booking affidavit. No injuries were reported.\"The arrestee committed a violent felony in a road rage incident against a stranger that was driving during their daily commute. The impulsive and violent actions of the suspect clearly demonstrate Kenneth is a substantial danger to any individual and the community,\" police wrote in their affidavit.Unified Police Sgt. Aymee Race says prior to the shooting, the victim told police that he noticed Richardson driving aggressively behind him. As Richardson continued to follow the victim, at one point he allegedly drove into the bike lane and tried cutting off the victim by swerving into him before firing a round, Race said. The victim continued driving after the shot and was pulled over a short time later by a Unified officer while trying to get away. When the victim told the officer what had happened, the road rage investigation began.Officers returned to the area where the shot was allegedly fired and found a shell casing, the affidavit states.Detectives learned that Richardson goes to a smoke shop in the area on almost a daily basis and was seen there prior to the shooting, the affidavit states. They were able to collect enough information to identify Richardson as a possible suspect and found the vehicle allegedly involved in the road rage parked at his home in Holladay, according to the affidavit.On Wednesday, Richardson was stopped by Salt Lake City police and found to have marijuana in his vehicle in addition to \"an empty firearm case for a 9 mm handgun, and a partially filled box of 9 mm ammunition,\" the affidavit states.A red hoodie that matched what the alleged gunman wore in the Sept. 21 shooting was also found, police stated. What prompted Richardson to allegedly go after the other driver remained under investigation Thursday.According to court records, Richardson was convicted of aggravated assault in 2018. In that case, Richardson had been working at Dunford Bakery for three days but became upset and aggressive when being told how to perform his duties, according to charging documents. After he was asked to leave, Richardson threatened to shoot one employee and slashed another with a knife, the charges state."}, {"source": "ksl.com", "url": "https://www.ksl.com/article/51140323/the-us-is-mailing-americans-covid-tests-again-heres-how-to-get-them", "title": "The US is mailing Americans COVID tests again. Here's how to get them", "author": "Amanda Seitz, Associated Press", "date": "Sept. 26, 2024 at 12:28 p.m.", "content": "WASHINGTON — Americans can once again order COVID-19 tests, without being charged, that will be sent straight to their homes.The U.S. government reopened the program on Thursday, allowing any household to order up to four at-home COVID nasal swab kits through the website, covidtests.gov. The tests will begin shipping, via the United States Postal Service, as soon as next week.The website has been reopened on the heels of a summer COVID-19 virus wave and heading into the fall and winter respiratory virus season, with health officials urging Americans to get an updated COVID-19 booster and their yearly flu shot.\"Before you visit with your family and friends this holiday season, take a quick test and help keep them safe from COVID-19,\" U.S. Health and Human Services Assistant Secretary for Preparedness and Response Dawn O'Connell said in a statement.U.S. regulators approved an updated COVID-19 vaccine that is designed to combat the recent virus strains and, they hope, forthcoming winter ones, too. Vaccine uptake is waning, however. Most Americans have some immunity from prior infections or vaccinations, but under a quarter of U.S. adults took last fall's COVID-19 shot.Using the swab, people can detect current virus strains ahead of the fall and winter respiratory virus season and the holidays. Over-the-counter COVID-19 at-home tests typically cost around $11, as of last year. Insurers are no longer required to cover the cost of the tests.Before using any existing at-home COVID-19 tests, you should check the expiration date. Many of the tests have been given an extended expiration from the date listed on the box. You can check on the Food and Drug Administration's website to see if that's the case for any of your remaining tests at home.Since COVID-19 first began its spread in 2020, U.S. taxpayers have poured billions of dollars into developing and purchasing COVID-19 tests as well as vaccines. The Biden administration has given out 1.8 billion COVID-19 tests, including half distributed to households by mail. It's unclear how many tests the government still has on hand."}, {"source": "ksl.com", "url": "https://www.ksl.com/article/51139606/new-emergency-alert-system-for-6-northern-utah-counties-being-put-in-place-this-week", "title": "New emergency alert system for 6 northern Utah counties being put in place this week", "author": "Alex Cabrero, KSL-TV", "date": "Sept. 26, 2024 at 12:00 p.m.", "content": "SALT LAKE CITY — A new emergency alert system is being put into place for six counties in northern Utah this week.Emergency managers are asking residents to make sure they are signed up for those alerts.\"I think it's critical to sign up,\" Mark Millett, Box Elder County's emergency manager, said. \"It is all about when bad things are happening, it is the process of us being able to push out lifesaving information.\"Box Elder, Weber, Davis, Morgan, Cache, and Rich counties are moving to a new emergency alert system called Everbridge from the old CodeRed system, which has been in place for about 10 years.Anyone who signed up for CodeRed's alerts in the past is automatically being moved to the new Everbridge system this week.Everbridge allows for more precise messaging and alerts that residents can sign up for.\"It allows us as counties to make our own decisions as counties how we wanted this to go,\" Lisa Gosline, Weber County's emergency manager, said. \"It also allows the user to sign up for what notifications they want. That way, they are not bothered with a road closure, or maybe it is a community event — they are not bothered with that. They just want those emergency notifications.\"Lots of people no longer have landline phones, which makes emergency notifications to as many people as possible more challenging for managers.\"In the old days, it was all just reverse 911 over your phone system. The wildcard in the world today is our cellphone,\" Millett said.Even still, emergencies happen and managers want to let people know what to do in those situations.The tricky part is getting people to sign up for the emergency alerts.\"When you're trying to get out a message that is super important, you want to make sure you can reach the end user,\" Gosline said."}, {"source": "ksl.com", "url": "https://www.ksl.com/article/51140392/legends-billy-joel-sting-coming-to-utah-as-part-of-small-us-tour", "title": "Legends Billy Joel, Sting coming to Utah as part of small US tour", "author": "                                            Carter Williams, KSL.com", "date": "Sept. 26, 2024 at 11:59 a.m.", "content": "SALT LAKE CITY — No need to have a heart attack ack, ack, ack, ack, ack over traveling to Billy Joel's newest North American tour because the Piano Man is coming back to Utah and he's bringing another rock legend with him.Live Nation Utah announced Thursday that Billy Joel and Sting will play at Rice-Eccles Stadium on May 23, 2025, mirroring similar stadium announcements earlier in the day. The two will also play at stadiums in Indianapolis; Syracuse, New York; and Charlotte, North Carolina, in early 2025.The Utah announcement was leaked early on Sting's website. Still, Live Nation carried on with a planned ceremony that ended with Utah football coach Kyle Whittingham riding into the stadium on his motorcycle while a medley of Billy Joel songs played on the stadium speakers.\"I'll tell what, I'm fired up,\" Whittingham said, as others on stage held up No. 25 Utes jersey with Billy Joel's and Sting's names printed on the back. \"When I heard (Joel) was coming, I was absolutely elated by that. I've been listening to Billy for 50-plus years.\"Joel last played in Utah back in November 2017 at what was then Vivint Smart Home Arena. Next year's show will be his 15th in the Beehive State, dating back to when he played at the Ice House in Provo 50 years ago, per Setlist.fm.Sting has been more of a Utah regular, having played in Utah five previous times since 2010, including a show in West Valley City last year. Combined, the two have 18 Grammy Award wins under their belts; both are also members of the Rock and Rock Hall of Fame.Citi card members will have access to presale tickets beginning at 10 a.m. on Monday, before general admission tickets go on sale at 10 a.m. on Oct. 4 through Ticketmaster.Thursday's announcement builds on the number of shows held at Rice-Eccles Stadium, which brought in Luke Combs, George Strait and Chris Stapleton to large crowds this summer. It's also hosted Garth Brooks and the Loveloud festival — orchestrated by Imagine Dragons frontman Dan Reynolds — in recent years.Jason Farrell, president of Live Nation Utah, explained that policy changes in recent years to allow alcohol sales at Rice-Eccles Stadium have made it easier to attract high-profile musicians when the field is available in the football offseason because it's made concerts more \"financially viable.\"Live Nation Utah plans to advertise the upcoming show with several surprises during athletics events this fall. Farrell didn't divulge all the plans, but said fans may see the Olympic Cauldron outside of the stadium lit to Billy Joel's \"We Didn't Start the Fire.\"\"It means everything that Utah is tied in and that it is a major market that these stadium tours are going to,\" he said, after the event. \"Even if our population is less, the spirit and the excitement for this level of entertainment is equal to anywhere.\""}, {"source": "ksl.com", "url": "https://www.ksl.com/article/51139282/father-of-teenage-suspect-in-north-carolina-mass-shooting-pleads-guilty-to-gun-storage-crime", "title": "Father of teenage suspect in North Carolina mass shooting pleads guilty to gun storage crime", "author": "Associated Press", "date": "Sept. 26, 2024 at 11:43 a.m.", "content": "RALEIGH, N.C. — The father of a teenager accused in a 2022 mass shooting in North Carolina's capital city that left five people dead pleaded guilty Wednesday to improperly storing a handgun that authorities said was found with his son after the shootings.Alan Thompson, 61, appeared to cry as he entered the plea to the misdemeanor charge in Wake County court, news outlets reported. District Court Judge Mark Stevens, who gave him a 45-day suspended jail sentence and a year of unsupervised probation, called the matter \"a case of epic tragedy.\"Thompson's attorney said in court there were no warning signs that Austin Thompson — accused of five counts of murder as well as other charges — would commit violence. The shootings happened when Austin Thompson was 15, and among the five people killed was his older brother.Austin Thompson is scheduled to go to trial in September 2025 and faces life in prison if convicted.\"As a parent, Alan is living the unthinkable, he has lost both his sons and still doesn't know why this happened,\" said Russell Babb, a lawyer representing Thompson's father and mother.Authorities have alleged the Oct. 13, 2022, killing rampage began when Austin Thompson shot and stabbed his 16-year-old brother in their east Raleigh neighborhood. He then shot multiple neighbors, including an off-duty Raleigh police officer on his way to work, according to police.Dressed in camouflage with multiple weapons strapped to his belt, he was located by law enforcement in a shed near a public greenway and arrested after an hours-long standoff. Investigators have said a handgun and a shotgun were used in the shootings.Wake County Assistant District Attorney Luke Bumm said Wednesday a handgun found in the shed belonged to Alan Thompson. According to Bumm, Alan Thompson kept the loaded 9 mm handgun in an unlocked box on a bedside table. The gun was consistent with evidence around the earliest victims, Bumm said. Alan Thompson was initially charged last year.Babb said Austin Thompson showed no signs of violence and that his father spoke with him twice on the phone in the moments leading up to and after the mass shooting.\"He did not seem agitated,\" Babb said. \"He did not seem angry. He did not seem upset.\"Babb said Alan Thompson spoke to him while driving home from work, and that he asked if he needed anything while he stopped to get a gallon of milk. He then saw police cars rushing toward the Hedingham neighborhood and called again to tell Austin Thompson to \"hunker down,\" according to Babb.Police work a shooting scene on Osprey Cove Drive in the Hedingham neighborhood in Raleigh, N.C., Oct. 13, 2022. (Photo: Ethan Hyman, The News & Observer)Police initially wouldn't let Alan Thompson enter the house, Babb said, and first responders told him his older son was killed and his younger son was missing. Babb said he assumed his younger son had gone to pursue the killer but that's when an officer told him \"Austin was not chasing the shooter. Austin was the shooter.\"\"Alan never in a million years thought his own family member would behave this way, he is heartbroken,\" Babb said.Also killed in the shootings were Officer Gabriel Torres, Mary Elizabeth Marshall, Nicole Connors and Susan Karnatz. Two other people were wounded during the shootings, including another officer. Austin is also accused of attempted murder, assault with a deadly weapon with intent to kill and assault with a firearm on a law enforcement officer.Investigators seized 11 firearms and 160 boxes of ammunition — some of them empty — from the Thompson home, according to search warrants. Wake County's top prosecutor has said Austin had a self-inflicted gunshot wound when he was captured."}, {"source": "ksl.com", "url": "https://www.ksl.com/article/51139630/usu-campus-on-alert-after-report-of-sexual-assault", "title": "USU campus on alert after report of sexual assault", "author": "Mike Anderson, KSL-TV", "date": "Sept. 26, 2024 at 11:04 a.m.", "content": "LOGAN — Police are asking Utah State University students to be alert after a report of a sexual assault at knifepoint near the campus. Police don't have many details, but they want people to be vigilant and aware.Logan police believed it happened late Sunday night or early Monday morning in the Logan City Cemetery, which borders the USU campus. Because it's so close by, campus police are asking everyone to watch out for themselves and others.\"It did make me really anxious about it, like it scared me,\" Lynn Sullivan, a student at the university, said.Students like Sullivan said they are grateful to be kept in the loop so they can be more self-aware.\"I feel like that's a good fear to have if it's happening,\" Sullivan told KSL-TV. \"And it's just good to have people know about it and really just be extra cautious.\"Logan police said they don't know a whole lot right now, just that a woman reported being sexually assaulted at knifepoint.\"We were informed that the victim did not want to have law enforcement involved,\" Curtis Hooley, assistant chief of the Logan Police Department, said. \"She was willing to have a sexual assault exam completed, which she did.\"Hooley said the fact that they have that evidence is important, and it's not unusual for victims to want to take some time.\"There's all types of people in regards to how they deal with that stress. And it isn't uncommon for people not to talk to law enforcement, especially in the first few days,\" Hooley told KSL-TV.But with the few details, he said it's not clear if the attacker was known to the victim or was a stranger. Administrators at Utah State University said it's important to make students aware both of what happened and the resources available, which is why an email was sent to students and employees.\"Usually these things, I feel like they don't really happen on campus, or this close to campus usually, because there's just so many people,\" Reya Thruman, a USU student, said. \"So the fact that it was so close to campus is kind of worrisome.\"The cemetery does get a lot of pedestrian traffic from students. Police are asking everyone to not go alone, and be aware of their surroundings. Campus police want students to know they can always call police to ask for a walk home, or make the request in the Aggie Safe app.If you have experienced sexual violence, you can access help and resources by calling Utah's 24-hour Sexual Violence Help Line at 1-801-736-4356 (English) or 1-801-924-0860 (Spanish). You can also call the Rape Recovery Center office line during office hours at 801-467-7282 or the National Sexual Assault Hotline at 1-800-656-4673 for free, confidential counseling."}, {"source": "ksl.com", "url": "https://www.ksl.com/article/51139240/charges-filed-in-alleged-road-rage-at-pharmacy-drive-thru", "title": "Charges filed in alleged road rage at pharmacy drive-thru", "author": "                                            Pat Reavy, KSL.com", "date": "Sept. 25, 2024 at 1:57 p.m.", "content": "EAGLE MOUNTAIN — An Eagle Mountain woman arrested Tuesday following a report of a road rage incident at a pharmacy drive-thru is now facing formal charges.Christine Kotter, 53, was charged Thursday in 4th District Court with two counts of aggravated assault, a third-degree felony.On Tuesday, just after 6 p.m., a car was in line at a pharmacy in the Ranches area of Eagle Mountain when Kotter tried to pull in front of the vehicle, according to the Utah County Sheriff's Office. The passenger in the vehicle that was cut off got out of her car to talk to Kotter.\"At that point … Kotter took a handgun and pointed it at her and her driver,\" the sheriff's office stated. \"This driver said Kotter had her finger on the trigger of her handgun while pointing it at the complainant.\"Kotter allegedly claimed that she was the one who was cut off and that the other woman \"looked confrontational so (she) pulled out a handgun. The suspect then stated she said she would use the gun if the victim did not leave,\" a police booking affidavit states.However, the victims provided police with a video one of them recorded on her phone. In the video, \"the conversation (between Kotter and the women) looked calm and not agitated. Victim one stated she began to walk back to her vehicle and stated the suspect pulled a firearm out of her backpack and pointed it directly at her. Victim one stated the suspect stated she was going to … shoot her if she didn't leave,\" the affidavit states.A second woman, who is pregnant, exited the vehicle that was cut off and stood between Kotter and her friend as Kotter allegedly pointed her gun at both women, the affidavit states.Deputies who responded to the scene searched Kotter's vehicle and found a gun with \"a bullet in the chamber and was ready to fire,\" according to the affidavit."}, {"source": "ksl.com", "url": "https://www.ksl.com/article/51140119/nyc-mayor-eric-adams-says-he-doesnt-plan-to-resign-despite-federal-corruption-case-against-him", "title": "NYC Mayor Eric Adams says he doesn't plan to resign despite federal corruption case against him", "author": "Jake Offenhartz, Associated Press", "date": "Sept. 26, 2024 at 7:35 a.m.", "content": "NEW YORK — New York City Mayor Eric Adams was indicted Thursday on federal charges alleging that he secured bribes from foreign nationals and illegal campaign contributions in exchange for favors that included helping Turkish officials get fire safety approvals for a new diplomatic building in the city.Adams, a former captain in the New York City police department, faces conspiracy, wire fraud and bribery charges in a five-count indictment that describes a decade-long trail of crimes.At a news conference announcing the charges, Damian Williams, the U.S. attorney for Manhattan, said Adams had a duty to disclose gifts he received, but year after year \"kept the public in the dark.\"At a separate news conference outside Gracie Mansion, meanwhile, Adams said he doesn't plan to resign from his job running the country's largest city, telling reporters he hopes New Yorkers will wait to hear his legal team's defense before making any judgments.\"From here, my attorneys will take care of the case so I can take care of the city,\" he said at a hastily assembled news conference outside Gracie Mansion after the charges were made public. \"It's an unfortunate day. And it's a painful day. But inside all of that is a day when we will finally reveal why, for 10 months, I've gone through this. And I look forward to defending myself,\" he said.As Adams and others close to him addressed the media, protesters heckled them, with some chanting \"abuse of power\" as police circled them and one shouting, \"He's a corrupt mayor. He deserves to be in handcuffs.\"Federal prosecutors allege in the indictment that Adams \"not only accepted but sought illegal campaign contributions\" to his mayoral campaign. A senior official in the Turkish diplomatic establishment \"facilitated many straw donations\" to Adams and arranged for Adams and his companions to receive free or discounted travel on Turkey's national airline to destinations including France, China, Sri Lanka, India, Hungary, and Turkey, the indictment alleges.Adams \"compounded his gains\" from the illegal campaign contributions by gaming the city's matching funds program, which provides a generous match for small dollar donations. His campaign received more than $10 million in matching public funds as a result of the false certifications, according to the indictment.Adams allegedly \"solicited and demanded\" bribes, including free and heavily discounted luxury travel benefits from a Turkish official, the indictment alleges, noting that the official was seeking Adams' help pertaining to regulations of the Turkish consulate in Manhattan. Adams created and instructed others to create fake paper trails in order to falsely suggest he had paid for travel benefits that were actually free, prosecutors allege. He also deleted messages with others involved in his misconduct, at one point assuring a co-conspirator that he \"always\" deleted her text messages, according to the indictment.The charges were made public hours after FBI agents entered the mayor's official residence and seized his phone early Thursday.Adams spent 22 years in New York City's police department before going into politics, first as a state senator and then as Brooklyn borough president. He was elected as the city's second Black mayor in 2021.Gov. Kathy Hochul has the power to remove Adams from office. Her spokesperson, Avi Small, issued a statement late Wednesday that said \"Governor Hochul is aware of these concerning news reports and is monitoring the situation. It would be premature to comment further until the matter is confirmed by law enforcement.\"The indictment caps an extraordinary few weeks in New York City, as federal investigators have honed in on members of Adams' inner circle, producing a drumbeat of raids, subpoenas and high-level resignations that have thrust City Hall into crisis.Federal prosecutors are believed to be leading multiple, separate inquiries involving Adams and his senior aides, relatives of those aides, campaign fundraising and possible influence peddling of the police and fire departments.In the last two weeks alone, the city's police commissioner and head of the school's system have announced their resignations.FBI agents had seized Adams' electronic devices nearly a year ago as part of an investigation focused, at least partly, on campaign contributions and Adams' interactions with the Turkish government. Because the charges were sealed, it was unknown whether they dealt with those same matters.In early September, federal investigators seized devices from his police commissioner, schools chancellor, two deputy mayors and other trusted confidants both in and out of City Hall.All have denied wrongdoing.Correction: This story was updated to correct that prosecutors say Adams' campaign received more than $10 million, not more than $10,000, in matching public funds as a result of the false certifications."}, {"source": "ksl.com", "url": "https://www.ksl.com/article/51139714/dj-vu-state-committee-orders-utah-ag-to-release-his-calendar-again", "title": "Déjà vu: State committee orders Utah AG to release his calendar again", "author": "Annie Knox and Daniella Rivera, KSL-TV", "date": "Sept. 26, 2024 at 10:02 a.m.", "content": "SALT LAKE CITY – A state panel has decided again that Attorney General Sean Reyes's calendar is part of the public record and ordered Reyes' office to turn it over to the KSL Investigators.The State Records Committee voted 5-1 in KSL-TV's favor Wednesday, finding a new state law shielding government officials' calendars from public view doesn't apply to a KSL record request submitted shortly before the law took effect.\"Our lawmakers made a choice not to apply the new law to pending open records requests,\" Tammy Frisby, an attorney representing KSL in the records case, said after the hearing. \"Rather than respecting that choice, Attorney General Reyes continues to spend public resources to try to conceal information about how he spends his time.\"The decision fits in line with the committee's prior two orders on Reyes' calendar: the first in favor of the television station and a later order siding with the Salt Lake Tribune. Reyes' office has sued both news organizations to appeal the committee's decisions.An attorney general's spokesperson did not immediately respond to requests for comment.Reyes came under scrutiny in recent years for his time away from the office, including travel overseas with the nonprofit Operation Underground Railroad, a World Cup junket, and a visit to Nevada following the 2020 election.The attorney general has said he took those trips on his own time, without using taxpayer money. Hoping to learn more about how Reyes spends his hours on the clock, KSL filed a public records request in 2022.The State Records Committee first sided with KSL in the calendar battle the following year. Reyes sued KSL and the records committee to appeal, but a judge ruled the public and press get to see the record. Reyes' office is now appealing that court ruling.The public records showdown also spilled over to the state Capitol in February. Hours after the judge ruled in favor of KSL, lawmakers approved a proposal concealing calendars. The governor signed it into law the next day.Just after the February court ruling in KSL's favor, but before the new law passed, the news organization filed a new request for Reyes' calendar over a longer period of time – about four years – dating back to January 2020. Previously, KSL had asked to see two-and-a-half months' worth of the schedule, from August to mid-November of 2022.The records committee considered the newer, bigger request Wednesday. Committee members decided the new law does not apply retroactively, saying the new law made a substantive change rather than a procedural one.The panel voted in a meeting videoconference after deliberating in a closed session Wednesday. It heard arguments in the case on Sept. 19.Attorneys for KSL argued the public has a right to see officials' calendars in order to figure out how they're spending their time and how they're doing their jobs. The news organization agreed to redactions for Reyes' personal appointments and for locations of his work meetings.The attorney general's office argued lawmakers made clear in passing the measure that they believed calendars had always been intended stay under wraps.Records committee member Ed Biehler, who cast the only \"no\" vote Wednesday, noted the lawmaker behind the move described it to colleagues at the Legislature as a clarification rather than a true change.With those comments in mind, Biehler said, \"I believe that it is procedural and not substantive.\"In December, as public scrutiny of his ties to Operation Underground Railroad mounted, Reyes announced he would not seek reelection. His term ends in January."}, {"source": "ksl.com", "url": "https://www.ksl.com/article/51140158/hoda-kotb-is-leaving-nbcs-today", "title": "Hoda Kotb is leaving NBC's 'Today'", "author": "Jordan Valinsky and Brian Stelter, CNN", "date": "Sept. 26, 2024 at 9:35 a.m.", "content": "NEW YORK — Hoda Kotb, the co-host of NBC's morning show, \"Today,\" is leaving her position early next year, she announced Thursday.Kotb, one of the most famous faces on NBC, has co-hosted the program with Savannah Guthrie since 2017, taking over from Matt Lauer, who was fired following allegations of inappropriate sexual behavior at work.\"It was time for me to turn the page at 60,\" Kotb said on \"Today\" Thursday while holding back tears. \"I decided this is the right time for me to move on. I obviously had my kiddos late in life and I was thinking that they deserve a bigger piece of my time pie that I have.\"Kotb is viewed inside NBC as a crucial part of the \"Today\" show's connective tissue, since she hosts both the top two hours of as well as the 10 am \"Hoda & Jenna\" talk show.She added that it was the \"hardest decision of her life.\" Kotb has two young daughters that she adopted and wants to spend more time with them.Kotb joined NBC in 1998 as a correspondent on the \"Dateline\" newsmagazine. She was later named the co-host of the 10 am hour of \"Today\" in 2008 with Kathie Lee Gifford until 2019, when Jenna Bush Hager took over the role.Guthrie said that \"we don't want to imagine this place without you, so it's complicated because we love you so much and we don't ever want you to go away.\" However, she told her that she has \"guts for someone to leave at the top of their game.\"Kotb's exit represents one of the biggest changes to the morning television landscape in at least a decade. Shows like \"Today\" and ABC's \"Good Morning America\" are highly profitable parts of their parent companies and are cultural icons, even as the broadcast business shrinks overall.Network executives strive for consistency and when transitions have to happen, they manage the comings and goings very carefully, since so many ratings points are at stake.In a letter to \"Today\" staffers, Kotb said \"happily and gratefully, I plan to remain a part of the NBC family, the longest work relationship I've been lucky enough to hold close to my heart. I'll be around. How could I not? Family is family and you all will always be a part of mine.\"NBC did not immediately name a successor for Kotb, and it likely will not do so for months."}, {"source": "ksl.com", "url": "https://www.ksl.com/article/51139834/as-utah-womens-basketball-prepares-for-big-12-transition-high-expectations-remain", "title": "As Utah women's basketball prepares for Big 12 transition, high expectations remain", "author": "                                            Josh Furlong, KSL.com", "date": "Sept. 26, 2024 at 9:02 a.m.", "content": "SALT LAKE CITY — Lynne Roberts welcomed the high expectations at the end of last season.The Utah women's basketball coach told the world that her team's standard should no longer be measured on whether they make an appearance in the NCAA Tournament, but rather how deep into March her team can play.Making it to the Big Dance is just the beginning.For the third consecutive season, Utah made it to the NCAA Tournament last season. But the team fell short of its preseason goal to make it to the Elite Eight after several injuries finally caught up with the Utes against a sharpshooting Gonzaga team on their home court.But as Roberts and her team prepare for the upcoming season — their first in the Big 12 — none of those expectations have changed.\"Different year, same expectations,\" Roberts said on the first official day of practice on Monday. \"We're in a good place with where our program's at. Every year we bring in really good freshmen, and we've got a couple transfers, too, this year. But they're joining a group of established veterans, and so our culture's intact.\"They know what the expectations are. But, yeah, our expectations haven't changed. We want to make the NCAA Tournament, make a run in it, have a chance to compete for Big 12 title. Those expectations aren't going to change.\"The conference affiliation may have changed, as well as some of the personnel — Utah lost Alissa Pili, Issy Palmer and Dasia Young to graduation, though Young is now on the coaching staff — but everything else remains intact.It's a veteran unit that knows what it takes to meet, and potentially exceed, expectations for another season.The biggest boost to the team's potential success is the return of \"difference maker\" Gianna Kneepkens, who suffered a season-ending injury early in the 2023-24 season.\"Adding Gianna Kneepkens back is a blessing, and we're excited about that,\" Roberts said.\"G is a difference maker in every sense of the word,\" she added. \"She just brings a level of swagger when she plays. She's still not feeling like she's back to her normal self, and it probably will take a couple months to where she's completely ready for games. She hasn't been back that long, but she just brings a level of swagger that you can't put a value on it, or you can't really describe it.\"Kneepkens is cleared to play and will continue to acclimate back to the game as the season progresses. And as she feels more comfortable with her game, she'll resume her role as one of the best shot creators on the team.\"It's so good. Just really excited to be back out on the floor,\" Kneepkens said. \"Just feels like great energy out there. I mean, I'm just grateful to be out there. We've had great staff, coaching, teammates through the process, so just excited for this year. It went by fast, even though the days felt really slow.\"Utah Utes head coach Lynne Roberts talks to her team from the bench during the first half of an NCAA women's basketball game at the Jon M. Huntsman Center on the University of Utah campus in Salt Lake City on Saturday, Nov. 16, 2019. (Photo: Colter Peterson, Deseret News)But Kneepkens is just one part of a veteran team that returns starting guards Ines Vieira and Kennady McQueen, starting forward Jenna Johnson, and designated sixth-man Maty Wilke, who really developed as the season progressed last season as she was thrust into a starting role.Wilke is one of the players that Roberts said she's looking forward to seeing on the court the most this season, simply due to all the hard work she's put in over the offseason to continue to develop and improve her game.\"I'm most excited for her, I think, coming into this season,\" Roberts said. \"She's put in so much work in the dark when no one's watching, and she's playing with a different level of confidence and comfortability. I think she's gonna be someone that people aren't gonna talk about now, but at the end of the season, they're gonna be talking about. ... She looks really good.\"Beyond the familiar faces — which also includes forwards Reese Ross and Sam Crispe — Utah brought in Rhode Island transfer Maye Toure, who Roberts sees big things from and someone that will play a lot as Utah attempts to replace Pili in some fashion in the post.\"She's super athletic — 6-3, 6-4,\" Roberts said. \"She's gonna do well — plays really, really hard.\"There's also Michigan transfer Chyra Evans and freshmen Brooke Walker, Kylie Ray and Grace Foster who will help round out some depth pieces for a team that will continue to put an emphasis on hitting at a high rate from behind the 3-point line, while also utilizing some of the inside-out game with its post play to keep the shots flowing from deep.Day 1️⃣#GoUtespic.twitter.com/5t6ktuo79H— Utah Women's Basketball (@UTAHWBB) September 23, 2024The identity of the team, Roberts said, won't change — even as the personnel does. There will be new nuances and wrinkles to the game, but the identity and culture of the program will remain intact.\"I think it is my job to read who you have, use the summer and even the fall workouts to figure out what you have, what you don't have, and then kind of create a system that maybe plays to strengths,\" she said. \"But our identity of working really, really hard, we're going to help — the goal is always to play harder than you, play with toughness, and a collective spirit.\"Build on who we are, what we have, but we're adding some things and doing things a little differently because of personnel. ... So I think we're able to do some more things defensively and offensively; we've got to adapt a little bit.\"The biggest change will likely come from the outside as Utah transitions from a loaded and highly-competitive Pac-12 that featured several ranked teams on a yearly basis with the Big 12.But that change has the opportunity to be a good thing, too, according to Johnson.\"We're used to really hard competition, so I think that'd be good,\" Johnson said. \"I think the style of play, it's a little bit different in the Big 12. But I think also, like, they have to guard us. I think that gives us confidence. Like, we play a difficult style of basketball. We've played against people that have seen us year after year, so now it's kind of fun going in. Obviously a challenge on our end, but also a big challenge on their end to defend a team that they never really have.Kneepkens said playing \"some of the best competition in the country\" in the Pac-12 has prepared the team to manage the transition, especially as an experienced team.\"I think that will be good because we played great competition, and moving to the Big 12, it's another 16 deep of great teams,\" Kneepkens said. \"So just knowing that each night's not going to be easy, from top to bottom, so I think that's the most important thing. And just staying consistent each day, starting practice today, and building off it every single day, so we can be great by the time it's March, but just focusing on today now.\""}, {"source": "ksl.com", "url": "https://www.ksl.com/article/51139610/mortgage-lenders-see-uptick-in-refinance-new-purchase-activity-with-lower-rates", "title": "Mortgage lenders see uptick in refinance, new purchase activity with lower rates", "author": "Daniel Woodruff, KSL-TV", "date": "Sept. 26, 2024 at 8:43 a.m.", "content": "SALT LAKE CITY — Lenders in Utah and across the country are seeing an uptick in people looking for mortgages.The Mortgage Bankers Association reported Wednesday that mortgage applications were up 11% week over week, driven by falling mortgage rates. The national average for mortgage rates sat at 6.19% on Wednesday, according to Mortgage News Daily – a noticeable decrease over the last few months.It's the same story in Utah.\"We're absolutely noticing an uptick in interest and an uptick in activity and an uptick in applications in the last 10 to 14 days,\" said Lauren Patterson, a lender who sits on the board of the Utah Association of Mortgage Professionals.Patterson noted the increased activity in Utah is for both refinances and new purchases.Emma Nelson, who bought a townhome in Syracuse earlier this year, is one of those looking to refinance. When she and her husband closed on the purchase in March, their interest rate was 7.625%.Emma Nelson, who bought a townhome in Syracuse earlier this year, is one of those looking to refinance. Lenders across the U.S. are seeing an uptick in people wanting to refinance or buy new. (Photo: Mark Wetzel, KSL-TV)\"It was insane,\" Nelson said.Ever since then, the couple has hoped to eventually lock in a lower rate, and they feel the right time is almost here.\"We're just waiting to pull the trigger,\" Nelson said.Rates on the declinePatterson said mortgage rates are expected to continue to decrease over the next 12 to 18 months, especially if the Federal Reserve continues cutting interest rates, which is separate from the mortgage market but often related.\"Look at it carefully,\" Patterson said. \"Just because you can refinance doesn't necessarily mean that you should right now.\"Lauren Patterson is a lender who sits on the board of the Utah Association of Mortgage Professionals. He said said homeowners should get multiple quotes and calculate how long it will take to break even before refinancing a mortgage. (Photo: Mark Wetzel, KSL-TV)Patterson said homeowners should get multiple quotes and calculate how long it will take to break even.\"Housing has become the largest line item in a household budget,\" Patterson said, \"so anything that we can do to bring the cost of that down for people is a welcome benefit.\"In her case, Nelson estimates refinancing will save several hundred dollars a month, which would make a big difference.\"What world are we living in?\" she said. \"It's so expensive.\""}, {"source": "ksl.com", "url": "https://www.ksl.com/article/51138807/donations-support-pour-in-for-man-injured-at-piute-county-construction-scene", "title": "Donations, support pour in for man injured at Piute County construction scene", "author": "Jeff Richards, St. George News", "date": "Sept. 26, 2024 at 8:19 a.m.", "content": "ST. GEORGE — A 20-year-old construction worker continues to recover at a St. George hospital after sustaining crushing injuries to his legs in an incident involving a skid steer last week.On the morning of Sept. 18, Keegon Heath was working at a home construction site in Piute County with his older brother and one other worker when the skid steer he was driving tipped and fell into a concrete-lined space designed to be a cold storage area.Tiana Phillips and her husband, who own the home that's being built, rushed over to the scene from their rental home a couple of miles away as soon as they found out something had happened. They arrived there at about 9:40 a.m, approximately 20 minutes after the incident occurred.\"As soon as we got there, we saw what was happening,\" Tiana Phillips said. \"The ambulance had already gotten there by that time and they were working on him.\"Read the full article at St. George News.*KSL.com does not assure that the money deposited to the account will be applied for the benefit of the persons named as beneficiaries. If you are considering a deposit to the account, you should consult your own advisers and otherwise proceed at your own risk."}, {"source": "ksl.com", "url": "https://www.ksl.com/article/51139595/utah-mom-to-compete-on-american-ninja-warrior-on-13th-anniversary-of-sons-drowning", "title": "Utah mom to compete on 'American Ninja Warrior' on 13th anniversary of son's drowning", "author": "                                            Arianne Brown for KSL.com", "date": "Sept. 26, 2024 at 8:03 a.m.", "content": "PLEASANT GROVE — Sept. 26 is a day Jenedy Paige won't soon forget, but this time around, she hopes it will bring more joy than sorrow. This year, the day will be spent competing on the \"American Ninja Warrior\" stage in Las Vegas in memory of her son who drowned 13 years ago at the age of 3.\"My son's name was Victory Morgan, and he drowned in a swimming pool,\" Paige recalled. \"He was riding his tricycle and the bike went in. When it happened, we were thrown into every parent's worst nightmare where you call 911, and you watch the paramedics work on your son, and you just keep wondering when you're going to wake up.\"The accident happened in 2011, and Victory spent the next seven weeks in the hospital before losing his battle. It was a couple of days after he died when Paige found a way to cope with the grief: She went running.\"I was a casual runner until my son passed away, and then once he passed away, running took on a different life for me because it became a means for me to process stuff,\" she said. \"My son passed away on a Saturday, and then I went to church on Sunday, and then Monday morning I got up and I went for a run. The weight of grief is so real and so heavy, and I just needed all these different ways to help carry it. Running went from something that was just kind of moderately enjoyable for me to being something that was therapeutic.\"Paige began running longer distances including the half marathon, and as she regained a fitness level that she hadn't experienced before, she felt her body and mind wanting more. She joined a local gym to gain some upper body strength and then was introduced by a family member to bouldering. The act of conquering obstacles awakened something in her that would propel her into a world she didn't know existed.\"I had never bouldered before, and I fell in love with the idea that you have this problem that you have to solve, and you get stronger as you face your problems,\" she said.Getting stronger in the face of adversity became a way of life for Paige, and she wanted to exemplify it not just for herself, but she had a burning desire to help others who may also be struggling. One day about six years ago, she said that she had a thought pop into her mind that she couldn't explain.'Maybe God was trying to tell me something'\"I was at the gym, and I had this thought in my mind saying, 'You should apply for 'American Ninja Warrior,'\" Paige recalled. \"It was so strange because literally my only qualification for applying for 'American Ninja Warrior' was that I had watched 'American Ninja Warrior.' And so that thought was just absolutely insane to me. I just kind of pushed it aside, but then it was so weird because I'd go back to the bouldering gym early in the morning, and the thought just kept coming back.\"This was not my idea because I did not want to do it,\" she continued. \"I grew up a very religious person, and I just thought that maybe God was trying to tell me something. So I literally said a prayer that I never thought I would ever offer. And that prayer was, 'God. I have a feeling that I should apply to 'American Ninja Warrior.' Is this something you really want me to do?'She said the answer was \"yes.\"\"I had spent enough time developing a personal relationship with God that when he told me to do something, I knew I should listen. I thought that maybe there would be a casting producer who would read my story, and it would mean something to them and maybe that's why God is asking me to do it,\" Paige said.It turned out that someone did take notice, and in April of 2019, 34-year-old Paige got the call to be on the show in Tacoma, Washington. She described being intimidated as she waited for her turn to compete as \"just a mom\" surrounded by elite and even professional athletes. She said it was then when she felt a nudge from her son, Victory.\"As I went to the starting line, all of a sudden, I felt my son who passed away, and it was totally unexpected,\" she said. \"I didn't expect to feel him there, but all of a sudden I just felt a voice say, 'Let's do this, Mom.' I feel like all of my hesitancy and the fear kind of left at that moment.\"Paige was able to make it all the way to the fourth obstacle, which she learned was quite the accomplishment, not just for a rookie. Unfortunately, due to the editing process, her run wasn't aired on the show. And with it not being aired and her story not being shared, she started to wonder why God was asking her to compete.For the next three years, she continued her goal of being on the show, and each consecutive year, she would apply and get the call to compete. And each year when it came time for the show to air, she would be notified that her run would not be shown on television. And then a difficult run last year, with a fall early on, devastated her.A shift of perspectiveAs each year went on, and as Paige continued to improve upon her physical strength, she started to notice that her mental and spiritual strength was growing as well. Also an accomplished artist, she grew her professional studio and honed her craft.In May of this year, one of her art pieces was featured in a video on YouTube by The Church of Jesus Christ of Latter-day Saints. The piece was an image of hands catching a falling sparrow as a \"tribute to God's love for her and her family.\"She said that as she has strengthened herself, she has grown closer to God and has been better able to understand what she describes as God's purpose for her.\"I was actually devastated last year,\" she said. \"I remember going to my hotel room and just sobbing because I just felt so robbed. And then I felt God be like, 'Oh, wait, did you think this was about a TV show, Jen? Yeah, look at you. You're a totally different person. You are so much stronger. I care way more about the development of an individual than I do about a TV show.'\"With a shift in perspective, Paige decided to apply for the show one more time. This time, it was for her. Little did she know that when she got the call this past summer saying that she had made the cut, that she would be met with another message from God.She would be competing on Thursday, Sept. 26, which would be the 13th anniversary of the day her son, Victory, fell in the pool.\"When they called me and told me that my run day was Sept. 26, I knew it was a message from God,\" she said. \"There are a lot of other days in the year, and to have it on that day feels really beautiful and poetic, because I draw a lot of inspiration from my son, Victory.\"While the verdict on whether or not Paige makes it to the buzzer on \"American Ninja Warrior\" will take several more months, Paige said that Victory will always be hers."}]
