[{"source": "ksl.com", "url": "https://www.ksl.com/article/51142201/plane-crashes-into-utah-lake-leaving-occupants-submerged-for-an-extended-amount-of-time", "title": "Plane crashes into Utah Lake, leaving occupants 'submerged for an extended amount of time'", "author": "                                            Logan Stefanich, KSL.com", "date": "Sept. 27, 2024 at 11:21 a.m.", "content": "SARATOGA SPRINGS — A plane crashed into Utah Lake on Friday, resulting in its occupants being \"submerged for an extended amount of time.\"\"We've got crews of personnel out on the lake. They're just confirming some things. The plane's in about eight and a half feet of water ... the likelihood of anybody still being viable is diminishing,\" said Jess Campbell, Saratoga Springs Fire Department chief.This story will be updated."}, {"source": "ksl.com", "url": "https://www.ksl.com/article/51141689/new-york-city-mayor-eric-adams-pleads-not-guilty-to-taking-bribes-and-illegal-campaign-contributions", "title": "New York City Mayor Eric Adams pleads not guilty to taking bribes and illegal campaign contributions", "author": "Jake Offenhartz and Michael R. Sisak, Associated Press", "date": "Sept. 27, 2024 at 7:28 a.m.", "content": "NEW YORK — New York City Mayor Eric Adams pleaded not guilty Friday to federal bribery charges and other counts that have roiled the nation's biggest city after months of investigations, searches and subpoenas.Adams, a Democrat, entered the plea before a packed courtroom gallery in Manhattan a day after prosecutors revealed charges alleging that he accepted overseas travel and illegal campaign donations from people looking to buy his influence in city government.The mayor is accused of exploiting a yearslong relationship with people tied to Turkey, who funded his travel and fueled his run for mayor with donations that helped him qualify for more than $10 million in public campaign funds. People who aren't U.S. citizens are banned by law from donating to U.S. political candidates.After listening to Magistrate Judge Katharine Parker describe the charges against him, Adams said, \"I am not guilty, your honor.\"He faces five counts in the indictment: wire fraud, bribery, two counts of receiving campaign contributions from a foreign national, and conspiracy. If convicted of the most serious charge, wire fraud, he faces up to 20 years in prison, federal prosecutors said.Assistant U.S. Attorney Celia V. Cohen told the judge that prosecutors and Adams' lawyer, Alex Spiro, came to an agreement that would allow Adams to be released \"on his own signature,\" with the condition that he not contact any witnesses or individuals in the indictment, with accommodations for him to speak with members of his family and staff — but not about anything pertaining to the allegations.Prosecutors said they would provide Spiro with the names of people Adams may not contact.Adams, 64, is due back in court Wednesday for a conference before the case judge, Dale E. Ho. Spiro told Parker that the defense would file a motion to dismiss that day.Before the hearing, Adams gave a thumbs up but did not pause to speak to reporters as he headed into the courthouse flanked by his police security.The indictment unsealed Thursday accused Adams of taking a variety of improper gifts from Turkish officials and businesspeople, including free hotel stays and deeply discounted airline tickets to destinations including France, China, Sri Lanka, India, Hungary, Ghana and Turkey.In return, prosecutors said, Adams did favors for his patrons. That included helping Turkey get fire department approvals to open a new diplomatic tower in Manhattan, despite concerns about its fire safety system, prosecutors said.Adams says he is innocent. Spiro has said it was neither unusual nor improper for a government official to accept some travel perks. The mayor has denied ever knowingly accepting an illegal campaign contribution and said any help he gave people navigating city bureaucracy was just part of doing his job.In public remarks Thursday, Adams asked New Yorkers to avoid making any judgments until they heard his defense.Spiro, told reporters the travel perks and seat upgrades Adams accepted were commonly offered to VIPs and members of Congress.\"That's what airlines do,\" he said, noting that many of the charges relate to trips Adams took years ago when he was Brooklyn borough president.Adams has so far weathered calls to resign from his critics, some Republicans and the field of potential Democratic primary challengers he is expected to face in next June's mayoral primary. The New York Times editorial board, which did not endorse Adams when he was running for mayor in 2021, has also called on him to step down, arguing that he cannot continue to effectively govern the city while he fends off his criminal charges.Notably, top Democrats such as Senate Majority Leader Chuck Schumer and House Democratic leader Hakeem Jeffries have not asked Adams to resign. Both issued statements after the indictment was unsealed saying the legal process should be allowed to play out. The New York Post's editorial board similarly said Adams should be allowed to defend himself against the charges and described some what is alleged in the indictment as \"small potatoes.\"Gov. Kathy Hochul, a Democrat who has the power to remove Adams from office, also did not call on Adams to resign, but she appeared to issue a warning to a mayor she has often sought to portray as a close ally.\"While I review my options and obligations as the governor of New York, I expect the mayor to take the next few days to review the situation and find an appropriate path forward to ensure the people of New York City are being well-served by their leaders,\" Hochul said. \"We must give New Yorkers confidence that there is steady, responsible leadership at every level of government.\"It is unclear whether Adams' indictment is the last word on federal investigations involving the administration.Federal prosecutors are believed to be leading multiple, separate inquiries involving Adams and his senior aides and relatives of those aides. In early September, federal investigators seized devices from the police commissioner, schools chancellor, two deputy mayors and other trusted Adams confidants.In the last two weeks alone, the police commissioner resigned and the schools chancellor announced he would retire. Neither has been charged with a crime or been publicly accused of wrongdoing."}, {"source": "ksl.com", "url": "https://www.ksl.com/article/51142128/woman-assaulted-while-walking-to-car-in-utah-county-parking-lot-", "title": "Man arrested for alleged assault on woman walking to car in Utah County", "author": "                                            Pat Reavy, KSL.com", "date": "Sept. 27, 2024 at 10:58 a.m.", "content": "SARATOGA SPRINGS — A Saratoga Springs man was arrested Thursday for allegedly attacking a woman walking to her car in a store parking lot.Drake Broderick, 24, was booked into the Utah County Jail for investigation of forcible sexual abuse, aggravated assault, assault on a police officer, criminal mischief, disorderly conduct and making a threat of violence.On Thursday, a woman had just walked out of a store near 900 N. Redwood Road in Saratoga Springs when Broderick approached her in the parking lot, according to a police booking affidavit.\"While she began walking to her car, Louis walked up to her holding an object initially described as a stick which she stated she believed to be a weapon. While still approaching her Louis then asked her, 'Where do you think you're going?' to which she responded to her car. Louis switched the object from his right hand to his left hand and held it in a striking position just behind his neck,\" the affidavit states.Broderick then grabbed the woman, forcibly pulled her close to him and touched her inappropriately, according to the affidavit.\"The victim stated she was scared that the object that he had in his hand was a weapon and that he was going to kill her,\" police wrote in the affidavit.The woman broke free of Broderick and ran back into the store as he followed and grabbed her again. That's when others in the store stepped in to help the woman.\"Louis then began slamming his body forcefully against the store's glass windows and door while still holding the object in his hand,\" the affidavit states.When police arrived and took Broderick into custody, he allegedly \"made statements that he could have killed\" and also \"made statements towards the detaining officers that he was going to kill each of them,\" according to the affidavit.In 2020, Broderick was charged with making a terroristic threat against a care facility in Springville. The case was later dismissed after Broderick was determined to be incompetent to stand trial, according to court records."}, {"source": "ksl.com", "url": "https://www.ksl.com/article/51142124/kslcom-pickem-staff-picks-for-week-5-of-college-football", "title": "KSL.com Pick'em: Staff picks for Week 5 of college football", "author": "                                            KSL.com Sports", "date": "Sept. 27, 2024 at 10:26 a.m.", "content": "SALT LAKE CITY — It's time for another weekend of college football, and there's a great slate of games for you to choose from in Week 5.The weekend starts off with a morning game on the road for the Cougars, who travel to Waco, Texas, to take on Baylor. The road hasn't been as kind to No. 22 BYU (nor has the daytime) in the past, but it's a new season and the Cougars are 4-0.Will the Cougars keep their winning ways or will there be disappointment after a dismantling of Kansas State last week?No. 10 Utah closes out the night in a \"Dark Mode\" game against talented quarterback Noah Fifita and Arizona at Rice-Eccles Stadium. The Wildcats had the Utes' number last season, but can the magic of a night time game help lead Utah to victory and a 5-0 start to the season?In our three national games this week (Utah State has a bye), we get two ranked-vs-ranked matchups between Oklahoma State and Kansas State to help settle some of the Big 12 hierarchy, and Georgia going into Tuscaloosa to try to get a win over a new-look Alabama squad.And then there's Boise State welcoming a hot Washington State team to Idaho in what will soon become a conference game. The Broncos likely have more at stake as the team tries to remain the highest-ranking Group of Five team for a playoff spot.Head on over to KSL.com College Pick'em and fill out your weekly ballot before the games start."}, {"source": "ksl.com", "url": "https://www.ksl.com/article/51141732/at-least-11-people-dead-in-georgia-after-hurricane-helene-governor-says", "title": "At least 11 people dead in Georgia after Hurricane Helene, governor says", "author": "Stephen Smith, Kate Payne and Heather Hollingsworth, Associated Press", "date": "Sept. 27, 2024 at 6:57 a.m.", "content": "CRAWFORDVILLE, Fla. — The Georgia governor says at least 11 people in his state have been killed and dozens are still trapped in homes damaged by Hurricane Helene.Gov. Brian Kemp made the statement Friday at a news conference. He said authorities believe there are 115 structures with people trapped inside.The storm made landfall late Thursday in Florida's sparsely populated Big Bend area, which is home to fishing villages and vacation hideaways. It's where the Panhandle and peninsula meet. At least six people were reported dead.The storm made landfall with maximum sustained winds of 140 mph in the rural Big Bend area, home to fishing villages and vacation hideaways where Florida's Panhandle and peninsula meet.Video on social media sites showed sheets of rain coming down and siding coming off buildings in Perry, Florida, near where the storm arrived. One local news station showed a home that was overturned. The community and much of surrounding Taylor County were without power.First responders were out in boats early Friday to rescue people trapped by flooding in Citrus County, some 120 miles south of Perry.\"If you are trapped and need help please call for rescuers – DO NOT TRY TO TREAD FLOODWATERS YOURSELF,\" the sheriff's office warned in a Facebook post. Authorities said the water could contain live wires, sewage, sharp objects and other debris.More than 3 million customers were in the dark across much of the southeastern U.S.One person was killed in Florida when a sign fell on their car, and two people were reported killed in a possible tornado in south Georgia as the storm approached. Another person died in Charlotte, North Carolina, when a tree fell on a home.The hurricane came ashore near the mouth of the Aucilla River on Florida's Gulf Coast. That location was only about 20 miles northwest of where Hurricane Idalia came ashore last year at nearly the same ferocity and caused widespread damage.As the hurricane's eye passed near Valdosta, Georgia, a city of 55,000 near the Florida line, dozens of people huddled early Friday in a darkened hotel lobby as winds whistled and howled outside.Charles Starling, a lineman with Team Fishel, is pelted with rain as he walks by a row of electrical line trucks stage in a field in The Villages, Fla., Thursday, in preparation for damage from Hurricane Helene. (Photo: Stephen M. Dowell, Orlando Sentinel via AP)Electricity was out, with hall emergency lights, flashlights and cellphones providing the only illumination. Water dripped from light fixtures in the lobby dining area and roof debris fell to the ground outside.Fermin Herrera, 20, his wife and their 2-month-old daughter left their room on the top floor of the hotel, where they took shelter because they were concerned about trees falling on their Valdosta home.\"We heard some rumbling,\" said Herrera, cradling the sleeping baby in a downstairs hallway. \"We didn't see anything at first. After a while the intensity picked up. It looked like a gutter that was banging against our window. So we made a decision to leave.\"In Thomas County, Georgia, where residents had been under a curfew, the sheriff's office said it was extended until noon Friday.\"This curfew helps protect first responders and citizens of our community as conditions are still very hazardous. Please shelter in place,\" the office posted online.Helene is the third storm to strike the city in just over a year. Tropical Storm Debby blacked out power to thousands in August, while Hurricane Idalia damaged an estimated 1,000 homes in Valdosta and surrounding Lowndes County a year ago.\"I feel like a lot of us know what to do now,\" Herrera said. \"We've seen some storms and grown some thicker skins.\"Soon after it crossed over land, Helene weakened to a tropical storm over Georgia, with its maximum sustained winds falling to 70 mph. The storm was about 40 miles east of Macon and about 100 miles southeast of Atlanta, moving north at 30 mph at 5 a.m., the hurricane center in Miami reported.Forecasters expected the system to continue weakening as it moves into Tennessee and Kentucky and drops heavy rain over the Appalachian Mountains, with the possibility of mudslides and flash flooding.Helene prompted hurricane and flash flood warnings extending far beyond the coast up into northern Georgia and western North Carolina. More than 1.2 million homes and businesses were without power in Florida, more than 900,000 in Georgia and more than 927,000 in the Carolinas, according to the tracking site poweroutage.us. The governors of those states and Alabama and Virginia all declared emergencies.Even before landfall, the storm's wrath was felt widely, with sustained tropical storm-force winds and hurricane-force gusts along Florida's west coast. Water lapped over a road in Siesta Key near Sarasota and covered some intersections in St. Pete Beach. Lumber and other debris from a fire in Cedar Key a week ago crashed ashore in the rising water.Beyond Florida, up to 10 inches of rain had fallen in the North Carolina mountains, with up to 14 inches more possible before the deluge ends, setting the stage for flooding that forecasters warned could be worse than anything seen in the past century.\"Please write your name, birthday, and important information on your arm or leg in a PERMANENT MARKER so that you can be identified and family notified,\" the sheriff's office in mostly rural Taylor County warned those who chose not to evacuate in a Facebook post, the dire advice similar to what other officials have dolled out during past hurricanes.School districts and multiple universities canceled classes. Airports in Tampa, Tallahassee and Clearwater were closed Thursday, while cancellations were widespread elsewhere in Florida and beyond.Contributing: Seth Borenstein, Jeff Amy, Russ Bynum, Danica Coto, Andrea Rodríguez, Mark Stevenson, María Verza, Claire Rush"}, {"source": "ksl.com", "url": "https://www.ksl.com/article/51142103/federal-prosecutors-indict-st-george-sex-offender-suspected-of-downloading-illegal-images-coercing-minor", "title": "Federal prosecutors indict St. George sex offender suspected of downloading illegal images, coercing minor", "author": "Cody Blowers, St. George News", "date": "Sept. 27, 2024 at 9:40 a.m.", "content": "ST. GEORGE — A St. George man with a history of downloading child sexual abuse material is facing similar charges, including alleged enticement of a child.The man, Matthew Christian Radcliffe, 46, was indicted by assistant U.S. Attorney Christopher Burton in federal court Sept. 17 facing four federal charges, including one count each of possession of child pornography, receipt of child pornography and distribution of child pornography. He was also charged with one felony count of coercion or enticement for allegedly persuading or coercing a minor into sexual activity.The charges stem from an investigation wherein federal investigators allege during a seven-day period, from July 17 through July 23, Radcliffe \"knowingly\" received sexual abuse images involving children under 12 sent by computer.The coercion charge filed in the federal case was part of an investigation that took place in July when the defendant reportedly attempted to meet up with a child in St. George.Read the full article at St. George News."}, {"source": "ksl.com", "url": "https://www.ksl.com/article/51141736/pick-six-previews-exceeding-expectations-byu-the-better-team-against-baylor", "title": "Pick Six Previews: Exceeding expectations, BYU the better team against Baylor", "author": "Brett Ciancia, Pick Six Previews", "date": "Sept. 27, 2024 at 9:03 a.m.", "content": "PROVO — BYU shocked the college football world late Saturday night with a stunning 38-9 blowout win over then-No. 13 Kansas State to extend their undefeated start to 4-0.The 29-point margin marked the program's biggest win over a top-15 opponent in school history and vaulted BYU into the Associated Press Top 25 for the first time since October 2022.Kansas State led 6-0 with just two minutes left in the first half after controlling the first 28 minutes, but the next six minutes of game clock saw an absolute scoring explosion for BYU — 31 straight points — to solidify the victory early in the third quarter.The BYU defense created two turnovers in those final two minutes of the first half, returning a fumble for a touchdown and picking off Kansas State's Avery Johnson to set up another short touchdown drive. The defense picked him off again on the second half's opening drive, and forced a three-and-out series on the next possession to set up a punt situation.Parker Kingston fielded the punt at his own 7-yard line, retreated to his own goal, and then went 100 yards down the sideline for the legendary touchdown. Kingston's return threw LaVell Edwards Stadium into a frenzy that shook the television broadcast cameras and was certainly the \"play of the week\" in college football.BYU brings its undefeated record down to Waco, Texas, in search of its first-ever Big 12 road win (10 a.m. MDT, FS1).Game Grader(Opponent-adjusted statistical dominance via Pick Six Previews)3-year average (2021-23): BYU 45.3 (50th of 70 Power Four) | Baylor 50.6 (40th)2023 Season: BYU 32.6 (63rd) | Baylor 28.8 (66th)2024 season: BYU 64.5 (19th) | Baylor 46.2 (47th)My Game Grader formula is a measure of statistical dominance that adjusts for opponent strength and is a key piece of my preseason and in-season evaluation.Baylor went 3-9 last year and graded among the worst in Power Four football in almost all of my metrics. This year, they have dominated both their non-AQ opponents but are 0-2 against the Big 12.The Bears trailed Utah 17-0 at half before knocking out their starting quarterback Cam Rising, and then lost last week in a shocker to Colorado. Baylor allowed the unthinkable — a last-second 43-yard touchdown pass — on the final play of regulation, and then fumbled the ball at the goal-line in overtime.It was an awful loss, and one that head coach Dave Aranda called \"heart-wrenching.\"Baylor with the ball(Opponent-adjusted, per-play rankings via Pick Six Previews)Baylor offense (2024): 11th of 16 Big 12 (7th passing, 11th rushing)BYU defense (2024): 3rd of 16 Big 12 (2nd passing, 7th rushing)Baylor had a quarterback battle that extended far into fall camp between incumbent, Power Four veteran Sawyer Robertson and All-MAC performer Dequan Finn (Toledo).Finn won the battle, started the first two games but ranked just 15th in the Big 12 in QB Rating and is battling an injury. Robertson was handed the keys to the offense before the Air Force win, and he played well again Saturday against Colorado.On the season, Robertson ranks in the league's top five in several metrics like yards per attempt (9.3 yards), completion percentage (64%) and QB Rating.Robertson has poise in the pocket and was also able to burn Colorado with his legs on a 45-yard touchdown run. Even with the offensive coordinator change, Baylor has continued to go run-heavy with one of the most lopsided run/pass breakdowns in the entire league.This season marks Kalani Sitake's third 4-0 start to a season, joining 2020 and 2021. Those teams had NFL-caliber quarterback play and top-ranked explosive offenses. This 2024 edition is led by its defense.In that crazy six minutes in the middle of the game, Jack Kelly forced a fumble, Tommy Prassas returned it for a touchdown, defensive lineman Tyler Batty grabbed an interception, and then Harrison Taggart got the second pick.The BYU defense is playing elite football right now and kept both SMU and Kansas State out of the end zone, and has been one of the biggest year-over-year improvements in Power Four so far.BYU with the ball(Opponent-adjusted, per-play rankings via Pick Six Previews)BYU offense (2024): 12th of 16 Big 12 (12 h passing, 8th rushing)Baylor defense (2024): 10th of 16 Big 12 (7th passing, 16th rushing)So far, BYU is below the Big 12 average in yards per play and rushing yards per carry, but does check in at No. 6 in QB Rating. When you adjust for opponent, they fall in both categories — even in the 29-point win Saturday they were out-gained by 130 yards.That said, quarterback Jake Retzlaff earns credit for extending plays (and drives) with his legs; and compared to his 2023 starts he is improving and taking better care of the football.BYU remains thin at the running back spot, with original starter LJ Martin out, and backup Hinckley Ropati is \"doubtful\" for Saturday. Former walk-on Sione Moa took the opportunity and shined last week, with 76 yards on 15 carries, and should be featured again given Baylor's struggles defending the run.Aranda is a defensive guru who won a national title with LSU in 2019 and then turned Baylor into a conference champion in 2021. Since then, his defense has been collapsing.The stats and metrics look bad again for 2024, but you can throw out those numbers and just watch their last few plays on Saturday. They allowed a low-percentage touchdown pass on the final play — and nearly allowed another one on the prior play.BYU should be able to unlock more of its passing game this week against one of the league's worst pass defenses. Yes, the Baylor pass rush did sack Shedeur Sanders eight times, but that is par for the course with Colorado's nation-worst offensive line.Game predictionBYU entered 2024 with a 4.5 projected win total by Las Vegas but could eclipse that number Saturday before the calendar flips from September. They have exceeded my expectations so far, and are the better team in this matchup.Baylor's devastating loss last week will slow their start here, and BYU will climb to 5-0.BYU 30 | Baylor 23"}, {"source": "ksl.com", "url": "https://www.ksl.com/article/51142068/-skywest-flights-from-st-george-to-la-return-and-more-changes-to-come-to-st-george-regional-airport", "title": " SkyWest flights from St. George to LA return and more changes to come to St. George Regional Airport", "author": "Mori Kessler, St. George News", "date": "Sept. 27, 2024 at 8:42 a.m.", "content": "ST. GEORGE — Once-daily, round-trip flights to Los Angeles from St. George Regional Airport officially returned Thursday morning as a United Express jet took to the skies bound for Tinseltown.\"We're just really excited to resume this service,\" Marissa Snow, a spokesperson for SkyWest Airlines, said following the departure of the 50-seat Canadair Regional Jet from the regional airport.SkyWest Airlines, through its partnership with United Airlines, originally offered the United Express daily round-trip flight to Los Angeles from 2017 to 2020 when the COVID pandemic put a pause on the service. Since then, area officials and residents have pined for the route's return and received welcome news in June that it was restarting.\"The demand in St. George has only continued to grow since the pandemic, and we're really excited to add this fifth major destination,\" Snow said.Read the full article at St. George News."}, {"source": "ksl.com", "url": "https://www.ksl.com/article/51141613/reps-curtis-and-ocasio-cortez-offer-support-on-geothermal-energy", "title": "Reps. Curtis and Ocasio-Cortez offer support on geothermal energy", "author": "Gitanjali Poonia, Deseret News", "date": "Sept. 27, 2024 at 8:24 a.m.", "content": "SALT LAKE CITY — There are occasions when two Capitol Hill lawmakers from opposite sides of the aisle come together for the common good. Although this can be rare, it happened this week when Democratic New York Rep. Alexandria Ocasio-Cortez and Republican Utah Rep. John Curtis offered each other support on their bills.At the heart of this collaboration are two bills aimed at streamlining the permitting process for geothermal Energy.Curtis, in a press release sent to the Deseret News, said the Geothermal Energy Opportunity, GEO, Act, which his office proposed, would help \"unlock this resource to meet our energy needs.\"\"Geothermal energy is an affordable, reliable, and clean energy source,\" he said. \"Despite significant investments from companies to secure project permits, the Department of the Interior often delays authorizations — such as notices to proceed and drilling permits — due to litigation threats.\"He said he was \"thrilled to have unanimous support from my colleagues for this common-sense legislation.\"What did AOC say about Rep. John Curtis' bill?Ocasio-Cortez in her remarks on the House floor said the GEO Act requires permit applications to be reviewed within two months.But this efficiency will not sacrifice a proper review process, as mandated under the National Environmental Policy Act, the Endangered Species Act and the National Historic Preservation Act.She thanked Republicans for their willingness to work across the aisle to ensure both communities and the environment continue to enjoy their protections.\"Geothermal has the smallest footprint of any energy generation technology and uses significantly fewer resources than other sources, especially conventional fossil fuels,\" the New York Congresswoman said.But, as Axios reported, Ben Gruber, the chief for energy, minerals and realty management programs at the Bureau of Land Management, opposed Curtis' bill at a hearing Wednesday, saying it would create difficulties for the agency to comply with environmental regulations. The Biden White House isn't entirely skeptical of geothermal energy — Secretary of Energy Jennifer Granholm has said she couldn't be more excited about capturing the reliable and scalable \"heat beneath our feet\" and creating speedier permitting processes.Rep. Alexandria Ocasio-Cortez, D-N.Y., speaks during the Democratic National Convention on Aug. 19, in Chicago. She and Republican Utah Rep. John Curtis offered each other support on their bills this week. (Photo: Brynn Anderson, Associated Press)Ocasio-Cortez also introduced a related bill that expands the Geothermal Steam Act of 1970 and requires geothermal leaseholders to reimburse the Department of Interior for any fees incurred while the application is filed and the site is inspected and monitored.Including Curtis and Ocasio-Cortez's proposals, the House passed four bills related to geothermal energy Tuesday night.Rep. Bruce Westerman, R-Ark., the committee chairman, said the House GOP is keeping its \"foot on the gas\" as it passes a flurry of energy bills.\"Thoughtful legislation managing our resources well will restore American energy dominance, keep our natural treasures healthy for generations and reduce frustrating red tape that so often plagues our federal government,\" he said."}, {"source": "ksl.com", "url": "https://www.ksl.com/article/51141293/utah-agritainment-company-designs-corn-mazes-for-family-farms-across-us", "title": "Utah 'agritainment' company designs corn mazes for family farms across US", "author": "                                            Ivy Farguheson, KSL.com", "date": "Sept. 27, 2024 at 8:03 a.m.", "content": "LEHI — Who knew allowing people to trample through his cornfields every fall would be the difference between Brett Herbst keeping or losing his farm?Certainly not Herbst. He has been as surprised as anyone by the success of the Corn Maze and Sunflower Maze on his family farm.\"As a small farmer, you have to have as much control as you can ... fit in a niche,\" Herbst said. \"The corn mazes ... they've helped us tremendously. I wouldn't have been able to keep the farm without them.\"As a child, Hebst witnessed his father losing their family farm in Idaho. Bad financial decisions, decreased profits, and changes in the weather all contributed to the family's loss. The prices farmers receive for their produce can cause a loss in profits, making it difficult to keep ownership of a farm.The Herbst family has not been alone. Earlier this year, the Department of Agriculture reported that 141,733 family farms closed between 2017 and 2022. The amount of farm acreage has also decreased to slightly more than 880 million acres, the equivalent of the farming acreage in 1850.Given these changes, small family farmers have had to turn to unique ways to make money to support their work. Welcome to the corn maze.\"After I graduated from BYU, I was thinking of ways to be outside the box,\" Herbst said. \"Then I heard about a corn maze in Pennsylvania, and after thinking it over, we started one in American Fork.\"That maze, which opened in 1996, was the first money-raising one west of the Mississippi. It was so successful, other farmers started to reach out to him to help create the same thing on their land.His company, The Maize, does just that, assisting small family farmers throughout the United States, Canada and Europe with the creation of a functional corn maze on their properties. As of this year, the company has created mazes in 49 U.S. states, and even one in suburban New York City.The Cornbelly's mazes are at Thanksgiving Point in Lehi and the Herbst family farm in Spanish Fork. This year the family has created a likeness of country singer Luke Bryan as the maze for families to enjoy. More of their mazes across the country will also feature Bryan and other mazes honoring the 75th anniversary of the \"Peanuts\" comic strip.\"Having grown up farming in south Georgia and celebrating agriculture for the last 15 years on my farm tour, I'm honored that so many members of the farming community have chosen me to feature in their corn mazes across the country,\" Bryan said in a press release.Utah \"agritainment\" company The Maize helps family farms across the U.S. design mazes, including a sunflower maze featuring Snoopy at Cornbelly's in Spanish Fork. (Photo: The Maize)In its Spanish Fork sunflower maze and pumpkin patch, Cornbelly's has a Snoopy maze.\"For 75 years, 'Peanuts' has charmed, delighted, and moved fans through my father's creativity and wit — and what a wonderful way to celebrate his work than with the ingenuity of these 'Peanuts' corn mazes!\" said Jill Schulz, daughter of cartoonist Charles Schulz, in a statement.Across the country, family farmers have turned to corn mazes to help get them through the year's financial difficulties.Herbst was a pioneer in what is now called \"agritainment,\" forms of agricultural entertainment that raise enough money for farmers to keep their land. In the Beehive State, it's done that and more.\"We're a Utah tradition,\" said Kamille Combs, of Cornbelly's, emphasizing that it started as simply a \"word of mouth\" venture.Cornbelly's maze times:Lehi at Thanksgiving Point: Mondays — Saturdays through Nov. 2. Open 4-10 p.m. Mondays — Thursdays, and 10 a.m.-11 p.m. on Fridays, Saturdays and fall break daysSpanish Fork Pumpkin Farm: Mondays — Saturdays through Nov. 2. Open 4-9 p.m. Mondays — Thursdays and 10 a.m.-11 p.m. on Fridays, Saturdays and fall break daysInsanity Point Haunt in Lehi: Friday, Sept. 27, through Oct. 28. Open Mondays, Fridays and Saturdays at 7 p.m."}, {"source": "ksl.com", "url": "https://www.ksl.com/article/51142003/maggie-smith-star-of-stage-film-and-downton-abbey-dies-at-89", "title": "Maggie Smith, star of stage, film and 'Downton Abbey,' dies at 89", "author": "Jill Lawless, Associated Press", "date": "Sept. 27, 2024 at 7:35 a.m.", "content": "LONDON — Maggie Smith, the masterful, scene-stealing actor who won an Oscar for \"The Prime of Miss Jean Brodie\" in 1969 and gained new fans in the 21st century as the dowager Countess of Grantham in \"Downton Abbey\" and Professor Minerva McGonagall in the Harry Potter films, died Friday. She was 89.Smith's sons, Chris Larkin and Toby Stephens, said in a statement that Smith died early Friday in a London hospital.\"She leaves two sons and five loving grandchildren who are devastated by the loss of their extraordinary mother and grandmother,\" they said in a statement issued through publicist Clair Dobbs.Smith was frequently rated the preeminent British female performer of a generation that included Vanessa Redgrave and Judi Dench, with a clutch of Academy Award nominations and a shelf full of acting trophies.She remained in demand even in her later years, despite her lament that \"when you get into the granny era, you're lucky to get anything.\"Smith drily summarized her later roles as \"a gallery of grotesques,\" including Professor McGonagall. Asked why she took the role, she quipped: \"Harry Potter is my pension.\"Richard Eyre, who directed Smith in a television production of \"Suddenly Last Summer,\" said she was \"intellectually the smartest actress I've ever worked with. You have to get up very, very early in the morning to outwit Maggie Smith.\"\"Jean Brodie,\" in which she played a dangerously charismatic Edinburgh schoolteacher, brought her the Academy Award for best actress, and the British Academy Film Award (BAFTA) as well in 1969.Smith added a supporting actress Oscar for \"California Suite\" in 1978, Golden Globes for \"California Suite\" and \"Room with a View,\" and BAFTAs for lead actress in \"A Private Function\" in 1984, \"A Room with a View\" in 1986, and \"The Lonely Passion of Judith Hearne\" in 1988.She also received Academy Award nominations as a supporting actress in \"Othello,\" \"Travels with My Aunt,\" \"Room with a View\" and \"Gosford Park,\" and a BAFTA award for supporting actress in \"Tea with Mussolini.\" On stage, she won a Tony in 1990 for \"Lettice and Lovage.\"Her work in 2012 netted three Golden Globe nominations for the globally successful \"Downton Abbey\" TV series and the films \"The Best Exotic Marigold Hotel\" and \"Quartet.\"Smith had a reputation for being difficult and sometimes upstaging others.Richard Burton remarked that Smith didn't just take over a scene in \"The VIPs\" with him: \"She commits grand larceny.\" However, the director Peter Hall found that Smith wasn't \"remotely difficult unless she's among idiots. She's very hard on herself, and I don't think she sees any reason why she shouldn't be hard on other people, too.\"Smith conceded that she could be impatient at times.\"It's true I don't tolerate fools, but then they don't tolerate me, so I am spiky,\" Smith said. \"Maybe that's why I'm quite good at playing spiky elderly ladies.\"Critic Frank Rich, in a New York Times review of \"Lettice and Lovage,\" praised Smith as \"the stylized classicist who can italicize a line as prosaic as 'Have you no marmalade?' until it sounds like a freshly minted epigram by Coward or Wilde.\"Smith famously drew laughs from a prosaic line — \"This haddock is disgusting\" — in a 1964 revival of Noel Coward's \"Hay Fever.\"\"But unfortunately the critics mentioned it, and after that it never got a laugh,\" she recalled. \"The moment you say something is funny it's gossamer. It's gone, really.\"Margaret Natalie Smith was born in Ilford, on the eastern edge of London, on Dec. 28, 1934. She summed up her life briefly: \"One went to school, one wanted to act, one started to act, one's still acting.\"Her father was assigned in 1939 to wartime duty in Oxford, where her theater studies at the Oxford Playhouse School led to a busy apprenticeship.\"I did so many things, you know, round the universities there. ... If you were kind of clever enough and I suppose quick enough, you could almost do weekly rep because all the colleges were doing different productions at different times,\" she said in a BBC interview.She took Maggie as her stage name because another Margaret Smith was active in the theater.Laurence Olivier spotted her talent, invited her to be part of his original National Theatre company and cast her as his co-star in a 1965 film adaptation of \"Othello.\"Smith said two directors, Ingmar Bergman and William Gaskill, both in National Theatre productions, were important influences.Alan Bennett, preparing to film the monologue \"A Bed Among the Lentils,\" said he was wary of Smith's reputation for becoming bored. As the actor Jeremy Brett put it, \"she starts divinely and then goes off, rather like a cheese.\"\"So the fact that we only just had enough time to do it was an absolute blessing really because she was so fresh and just so into it,\" said Bennett, who also wrote a starring role for Smith in \"The Lady in the Van.\"However extravagant she may have been on stage or before the cameras, Smith was known to be intensely private.Simon Callow, who acted with her in \"A Room with a View,\" said he ruined their first meeting by spouting compliments.\"I blurted out various kinds of rubbish about her and she kind of withdrew. She doesn't like that sort of thing very much at all,\" Callow said in a film portrait of the actress. \"She never wanted to talk about acting. Acting was something she was terrified to talk about because if she did, it would disappear.\"Smith was made a Dame Commander of the British Empire, the equivalent of a knight, in 1990.She married fellow actor Robert Stephens in 1967. They had two sons, Christopher and Toby, and divorced in 1975. The same year she married the writer Beverley Cross, who died in 1998.Associated Press writer Robert Barr contributed biographical material to this obituary before his death in 2018."}, {"source": "ksl.com", "url": "https://www.ksl.com/article/51141617/serial-sexual-predator-at-center-of-ksl-investigation-receives-second-prison-sentence-this-month", "title": "Serial sexual predator at center of KSL Investigation receives second prison sentence this month", "author": "Daniella Rivera, KSL-TV", "date": "Sept. 27, 2024 at 6:23 a.m.", "content": "SALT LAKE CITY – A serial sexual predator at the center of a KSL Investigation has been sentenced to prison for the second time this month.Through the Failure to Protect series, the KSL Investigators exposed gaps in Utah's criminal justice system that kept Joshua Homer, 28, free for years.Homer was sentenced to five years to life in prison in a case involving three survivors in Davis County earlier this month.On Thursday, he pleaded guilty to an amended count of attempted rape in a Salt Lake County case involving a woman who said she was assaulted by Homer in 2014. She came forward to police following KSL's reporting on other cases against Homer.The KSL Investigators dug into his criminal past and found crimes against women and girls spanning a decade but no prison time.On Thursday, he was sentenced to three years to life in prison. The two prison sentences will run consecutively, meaning for several Utah survivors, their perpetrator will be in prison for at least eight years.\"Somebody can serve their time and then come out and move on with their life. But often, for some of the trauma for our survivors, this will be with them for the rest of their life,\" said Salt Lake County District Attorney Sim Gill. \"So, the disproportionality of the harm that is caused is sometimes not captured by the sentence, but we can certainly be rest assured that for a period of time, he's going to be inside a prison and where he belongs, and he will not be harming anybody out here.\"In a statement shared with the KSL Investigators, the survivor in the case wrote, \"I hope that this conviction helps victims of sexual assault want to come forward. Whether your assault happened 10 years ago like mine, or one week ago, your voice will always matter. You deserve to heal, be heard, and see justice be served.\"Homer was arrested for a probation violation the day after KSL's first Failure to Protect report aired in December 2022 and has been in custody since.Homer also faces new charges filed in August. He's accused of having a contraband cellphone in the Duchesne County Jail, a third-degree felony.This report is part of a series examining how apparent gaps at every level of Utah's criminal justice system fail to protect Utahns.Domestic violence resourcesHelp for people in abusive relationships can be found by contacting:Utah Domestic Violence Coalition: Utah's confidential statewide, 24-hour domestic violence hotline at 1-800-897-LINK (5465)YWCA Women in Jeopardy program: 801-537-8600Utah's statewide child abuse and neglect hotline: 1-855-323-DCFS (3237)National Domestic Violence Hotline: 1-800-799-7233"}, {"source": "ksl.com", "url": "https://www.ksl.com/article/51141449/new-judge-sets-expectations-in-case-against-man-charged-with-killing-4-idaho-university-students", "title": "New judge sets expectations in case against man charged with killing 4 Idaho university students", "author": "Rebecca Boone, Associated Press", "date": "Sept. 26, 2024 at 10:46 p.m.", "content": "BOISE, Idaho — A routine status hearing for a man accused of fatally stabbing four University of Idaho students drew a small crowd Thursday, with people beginning to line up outside the Boise courtroom five hours early in hopes of getting a seat.It was the first hearing for Bryan Kohberger since the case was moved to a new venue about 300 miles from the small college town of Moscow, Idaho, where the killings occurred.Kohberger is charged with four counts of murder in the deaths of Ethan Chapin, Xana Kernodle, Madison Mogen and Kaylee Goncalves, who were killed in the early morning of Nov. 13, 2022, at a rental home near campus.When asked to enter a plea last year, Kohberger stood silent, prompting a judge to enter a not-guilty plea on his behalf. Prosecutors have said they will seek the death penalty if Kohberger is convicted.Status conferences are typically uneventful, designed so the parties in a legal case can provide updates to the judge and schedule deadlines for future proceedings.But when the Idaho Supreme Court moved the case to Boise earlier this month, it also turned it over to a new presiding judge, appointing 4th District Judge Steven Hippler to replace 2nd District Judge John Judge.The venue was changed after Kohberger's defense attorneys successfully argued that extensive media coverage and strong emotions in the university town would make it difficult to find an impartial jury.\"I'd like to tell you I'm happy to be here, but why start with an untruth,\" Hippler said at the beginning of the hearing. He then began to lay out his expectations for the attorneys.\"I do expect — and this will come as no surprise to you — for you all to get along,\" Hippler said.The stakes in the case are \"as high as they can be,\" the judge said, but the attorneys are professionals who took an oath to uphold justice.\"I expect for you at all times to remain civil to each other, that you not engage in personal attacks, ad hominem attacks, that you not engage in theatrics, not misstate facts or the law to the court,\" Hippler said.He also said he expected all of the parties in the case to religiously follow a sweeping gag order issued by the previous judge.Kohberger's trial is currently set to begin next June and is expected to last between three and four months. Hippler said he worried that would be too challenging for jurors because it would span the entire summer vacation, when kids are home from school and family trips are often planned.He suggested either starting the trial sooner, in May, or pushing the start date to September. When Latah County Prosecuting Attorney Bill Thompson said he preferred May, and defense attorney Ann Taylor said she preferred a September date, the judge decided to hold a closed hearing so both sides could present their arguments.Taylor also said the defense team had been working with a special mitigation expert since the start of the case but the expert died, forcing the team to find a replacement. They now have a new person to fill the role, Taylor said, but the expert is not yet up to speed on the case, so additional preparation time may be needed.The judge is expected to issue a written order once a new trial date is set."}, {"source": "ksl.com", "url": "https://www.ksl.com/article/51141624/big-12-soccer-krommenhoek-vance-save-byus-2-2-draw-with-oklahoma-state", "title": "Big 12 soccer: Krommenhoek, Vance save BYU's 2-2 draw with Oklahoma State", "author": "                                            Sean Walker, KSL.com", "date": "Sept. 26, 2024 at 10:29 p.m.", "content": "PROVO — Mika Krommenhoek's inaugural goal in a BYU uniform helped the women's soccer team accomplish its three main objectives Thursday night: score first, score early, and score again.But what between the objectives will cost them a home win.Krommenhoek scored in the fourth minute, and Mackenzee Vance added another in the second half as the Cougars rallied to tie Oklahoma State 2-2 in front of an announced crowd of 3,170 fans at South Field.Presley Freeman added an assist for the Cougars (4-4-3, 2-1-1 Big 12) to stay unbeaten on South Field in league play, but not perfect.\"We came out flying and got a nice goal, right into the assist zone that we talk about all the time — and then we didn't do it for the rest of the half. We just make it harder than we need to,\" BYU coach Jennifer Rockwood said. \"We're really excited for Mika, though; she's played a lot of minutes for us, and I think she's getting better with each game.\"Alpine native Nicole Ray had a goal and an assist for Oklahoma State (8-2-2, 1-2-1 Big 12) to help the Cowgirls snap a two-match losing skid with her fifth goal of the year in front of dozens of family and friends from her time at Lone Peak and Utah Valley University.\"My first thought, the second it went into the back of the net was to go to my family. I wanted to give them some love and show something for them,\" Ray said. \"It just means more when you have your people here, people who support you. Obviously, it was huge to have all the people that I love, and who got me to this point, to see an opportunity to play my senior year.\"Feels good to be homeBack in her home state and with a large contingent of fans in the crowd, Nicole Ray notches her 5th goal of the season#GoPokespic.twitter.com/phTQ0OIsr7— OSU Cowgirl Soccer (@CowgirlFC) September 27, 2024Krommenhoek opened the scoring just four minutes into the match with a one-touch redirection from Freeman, the true freshman from Georgia who shrugged off two defenders while driving down the right side of the penalty area before cutting a cross back to Krommenhoek for the 1-0 edge.\"We've been working a lot on that in practice, getting into the right places, and into the assist zone,\" said Krommenhoek, a Maple Mountain alum. \"I just knew I needed to be where I was, and my teammate got me the ball right where I needed to be to put it in the back of the net.\"It was a perfect cross. Obviously, it caught the other team off guard.\"Ray helped the Cowgirls pull even, delivering a corner kick to Xcaret Pineda on a corner kick in the 31st minute as Oklahoma State took a 1-1 stalemate into halftime.BYU out-shot the Cowgirls 9-3 before the break, but put just three shots on target to Oklahoma State's two.Emma Hamberlin nearly pulled the Cougars ahead in the 69th minute, but her shot from distance kissed the top side of the crossbar before rattling the net behind the goal.Instead, Ray gave the Cowgirls the advantage in the 73rd minute, getting a touch on a long ball into the box from Pineda that she rainbow-shot well over BYU goalkeeper Lynette Hernaez's head and underneath the crossbar for a 2-1 edge.Vance taps it home👊📺 https://t.co/pq21r6weE8pic.twitter.com/ZFUuyJzTns— BYU Women's Soccer (@byusoccer_w) September 27, 2024The lead didn't last long, though.Vance finished a right-footed shot in front of Oklahoma State goalkeeper Grace Gordon to equalize in the 76th minute, taking advantage of chaos in the box caused by a corner kick before smashing the equalizer in a match where BYU out-shot the visitors 22-10, but put just six shots on target.\"I feel like things are clicking a lot right now,\" Krommenhoek said. \"Obviously, we have a very new team and it's taken time to learn to work together and learn each others' tendencies. And I feel like the more we play together, the more comfortable we get out there. We're all just working better and better with each game.\"BYU hosts Iowa State at 7 p.m. MDT (ESPN+), while Ray and the Cowgirls will travel north to face Utah on Sunday (1 p.m. MDT, ESPN+).Cyclones hold Utes scoreless in SLCUtah's Kasey Wardle and Iowa State's Avery Gillahan each collected a shutout as the Utes and Cyclones played to a 0-0 draw Thursday night at Ute Soccer Field.Utah (4-4-3, 1-2-1 Big 12) out-shot the visitors 6-4, but Gillahan made four saves to keep the Utes at bay.Wardle had two saves for Utah."}, {"source": "ksl.com", "url": "https://www.ksl.com/article/51141533/a-legacy-of-trauma-u-museum-hosting-event-to-honor-victims-of-native-boarding-school-system", "title": "'A legacy of trauma': U. museum hosting event to honor victims of Native boarding school system", "author": "                                            Tim Vandenack, KSL.com", "date": "Sept. 26, 2024 at 10:21 p.m.", "content": "SALT LAKE CITY — Maybe the era of Native American boarding schools is past. But that doesn't mean the lingering effects and trauma caused by the system have faded away, says Dena Ned, an associate University of Utah professor and director of the University of Utah's Indigenous Social Work Scholars Program.\"Those traumatic events changed behavior, changed culture and were passed on to the next generation. That's what's most difficult, because of the ripple effect on families and communities now today,\" she said.The Natural History Museum of Utah at the U. is hosting an event Saturday to raise awareness about the impact the boarding school system has had and commemorate those victimized by it. Ned, a citizen of the Chickasaw Nation of Oklahoma, will moderate a panel discussion on the issue as part of the varied activities, which go from 11 a.m. to around 2 p.m.Organizers are tying the events to National Day for Truth and Reconciliation, marked on Sept. 30 each year in Canada to honor victims of the Indigenous boarding school system in that country. It's the first time the Natural History Museum has hosted such an event, but organizers note that Utah, as home to seven boarding schools in years past, had a role in the \"troubled\" boarding school history.Dena Ned, director of Indigenous social work scholars at the University of Utah's College of Social Work, in an undated photo. (Photo: University of Utah)\"It is essential that we honor the survivors, their families and those who never returned while supporting the collective healing journey. Only through recognition and reflection can true reconciliation and understanding be achieved,\" Jason Cryan, the museum executive director, said in a statement. Museum admission is required to attend the event, though enrolled members of Native American tribes in the United States and their kids may enter for free.Ned, likewise, said events like Saturday's commemoration serve as a step forward in trying to process the continuing impact of the boarding school system.\"History impacts today. And so to have this acknowledgment, or commemoration, of a day for truth and reconciliation, that's incredible,\" she told KSL.com. \"I don't think we move past the impact, but I think we can move toward an understanding of a history that is often left out of a dominant society conversation.\"According to the museum, hundreds of thousands of Native American children from 1869 to the 1960s were taken from their homes and placed in boarding schools run by the federal government and other entities. \"These institutions aimed to dismantle Native cultures and communities by assimilation, stripping students of traditional clothing, hair and other cultural symbols and practices. Students at the schools were often subjected to physical, sexual, cultural and spiritual abuse,\" according to the museum.Read more:Multicultural UtahLooking for more news about the different cultures that call Utah home? Visit our Multicultural Utah section for more stories, events and features.According to the National Native American Boarding School Healing Coalition, Utah was home to seven boarding schools for Native Americans. Last year, Utah State University researchers using ground-penetrating radar uncovered the sites of multiple suspected graves of Native American children in and around the site of the former Panguitch Indian Boarding School in Panguitch, which operated from 1904-1909, according to the coalition.\"More research is required to determine if graves exist at the sites of other schools,\" said Margaret Chamberlain, who handles communications for the museum.Ned described the boarding school system as one phase of evolving federal policy toward Native Americans over the years and an \"extension of the history of colonization\" that started with the arrival of European explorers in the Americas.The litany of \"historical injustices\" Native Americans have faced stemming from government policy, including forced attendance at boarding schools, contributes \"to a legacy of trauma,\" she said. \"How are you supposed to heal? ...You doubt yourself and you doubt ... your elders or your community because of the power and the force of others to say we were wrong. That's intergenerational trauma.\"Tribal communities move past the traumas they have faced by \"taking back their systems and institutions\" lost at the hands of the U.S. government, she said. Still, the process is fraught with uncertainty. \"How many generations does it take to get past that?\" Ned said.Saturday's activities also include Native drumming and dancing, presentations by indigenous and U. officials, and the screening of a short film focused on the story of a South Dakota boarding school, \"Remember the Children.\""}, {"source": "ksl.com", "url": "https://www.ksl.com/article/51139829/judge-prepares-ruling-on-possible-retrial-of-movie-armorer-in-fatal-set-shooting-by-alec-baldwin", "title": "Judge prepares ruling on possible retrial of movie armorer in fatal set shooting by Alec Baldwin", "author": "Morgan Lee, Associated Press", "date": "Sept. 26, 2024 at 3:49 p.m.", "content": "SANTA FE, N.M. — A judge heard arguments Thursday on whether to dismiss a criminal conviction against a movie armorer in the shooting death of a cinematographer by actor Alec Baldwin and said she'll rule next week on whether to skuttle the case or order a retrial.In a remote court hearing, an attorney for Hannah Gutierrez-Reed challenged her March conviction for involuntary manslaughter, alleging that prosecutors failed to share evidence including ammunition that might have been exculpatory in the shooting death that occurred on the set of the Western movie \"Rust\" in 2021.Judge Mary Marlowe Sommer is reconsidering the armorer's felony conviction after throwing out an involuntary manslaughter case against Baldwin midtrial on similar grounds.\"This pattern of (evidence) discovery abuse occurred in Ms. Gutierrez-Reed's case in the same manner as it did in Mr. Baldwin's case,\" said Jason Bowles, lead defense attorney to Gutierrez-Reed.Baldwin, the lead actor and co-producer for \"Rust,\" was pointing a gun at cinematographer Halyna Hutchins during a rehearsal on a movie ranch outside Santa Fe in October 2021 when the revolver went off, killing Hutchins and wounding director Joel Souza. Baldwin has said he pulled back the hammer — but not the trigger — and the revolver fired.Marlowe Sommer dismissed the case against Baldwin based on the withholding of evidence by police and prosecutors. The case-ending evidence was ammunition that was brought into the sheriff's office in March by a man who said it could be related to Hutchins' killing.Prosecutors have said they deemed the ammunition unrelated and unimportant, while Baldwin's lawyers alleged that they \"buried\" it and filed a successful motion to dismiss the case. In her decision to dismiss the Baldwin case, Marlowe Sommer described \"egregious discovery violations constituting misconduct\" by law enforcement and prosecutors, as well as false testimony about physical evidence by a witness during the trial.Special prosecutor Kari Morrissey said at Thursday's hearing that defense counsel for Gutierrez-Reed knew of the ammunition in question prior to the armorer's trial but declined to enter it into the court record or have it tested to see whether it matched live ammunition on the set of \"Rust.\"Hannah Gutierrez-Reed, center, with her attorney Jason Bowles, left, and paralegal Carmella Sisneros, right, prepare for a sentencing hearing in state district court in Santa Fe, N.M., April 15. (Photo: Eddie Moore, The Albuquerque Journal)\"Evidence wasn't deliberately hidden from Mr. Bowles; it was provided to him by his own witness. He could have had it tested at any point in time,\" Morrissey said. \"I would respectfully ask the court to deny Mr. Bowles his motion\" to dismiss the case.Bowles said he didn't collect the ammunition himself because of concerns that it would alter the chain of custody and possibly disqualify the evidence from consideration at trail. He also asked the judge to remove Morrissey from the case in the event of a retrial and is seeking the immediate release of Gutierrez-Reed from incarceration.Gutierrez-Reed started serving an 18-month sentence in March and has appealed the jury's guilty verdict to a state appeals court. Prosecutors blamed Gutierrez-Reed for unwittingly bringing live ammunition onto the set and for failing to follow basic gun safety protocols.She was acquitted at trial of allegations she tampered with evidence in the \"Rust\" investigation. Gutierrez-Reed also has pleaded not guilty to a separate felony charge that she allegedly carried a gun into a bar in Santa Fe, New Mexico, where firearms are prohibited. A proposed plea agreement is awaiting court review.Gutierrez-Reed's attorneys have also said that prosecutors failed to properly disclose portions of pretrial interviews with \"Rust\" ammunition supplier Seth Kenney — as well as reports by firearms expert Lucien Haag — that might have changed the outcome of the armorer's trial.Morrissey challenged assertions that the evidence would have changed the outcome at trial. She said the interview with Kenney took place before her appointment to the case and that she was surprised to learn of the recording.\"My team was unaware of it,\" Morrissey said. \"It was absolutely a failure. There's no question about it. I immediately provided it to Mr. Bowles.\""}, {"source": "ksl.com", "url": "https://www.ksl.com/article/51141419/5-dead-in-crash-between-suv-semitruck-and-atv-on-us-6-near-price", "title": "5 dead in crash between SUV, semitruck and ATV on US 6 near Price", "author": "                                            Logan Stefanich and Cassidy Wixom, KSL.com", "date": "Sept. 26, 2024 at 3:09 p.m.", "content": "PRICE — Five people were killed in a multi-vehicle crash Thursday afternoon north of Price.A silver SUV was stopped on Spring Glen Road preparing to go east on U.S. 6, a statement from the Utah Highway Patrol says. The vehicle attempted to pull out into a designated acceleration lane but overshot and went into the next lane where a semitruck \"pulling doubles\" was driving.The wreckage of a semitruck involved in a deadly multivehicle crash Thursday on U.S. 6 north of Price. (Photo: Utah Highway Patrol)The truck tried to evade the car and lost control, \"veering to the left into westbound traffic,\" UHP said. The truck hit a westbound Nissan and pushed it off the roadway into a rock embankment. An ATV driving on the westbound shoulder was also struck during the crash.The four occupants of the Nissan and the ATV rider were killed in the crash. Identities of the deceased were not released Thursday.The crash caused heavy traffic delays along U.S. 6, UHP said."}, {"source": "ksl.com", "url": "https://www.ksl.com/article/51141120/utah-red-cross-heading-to-helenes-path", "title": "Utah Red Cross heading to Helene's path", "author": "Karah Brackin, KSL-TV", "date": "Sept. 26, 2024 at 9:36 p.m.", "content": "SALT LAKE CITY — On Thursday, a Utah team of American Red Cross volunteers were in the air heading south to help during Hurricane Helene's expected landfall.Marc Ellison, from American Fork, is heading to Macon, Georgia, where he will help with a shelter for those impacted by the storm.\"I'll be there to help assist with operations, whether it's setting up cots, making sure everyone gets fed, making sure all the families are accommodated,\" Ellison said.For the last two and a half years, Ellison has been volunteering with the Red Cross.Each of those volunteer opportunities has aided in his readiness for this moment in his first deployment.\"Learning, developing skills and knowledge. I'll be able to actually use that to help people. That's the thing I'm excited about,\" Ellison said.Utah Red Cross volunteers are teaming up with over 350 trained disaster workers from across the U.S. to help following the hurricane's expected landfall, according to the American Red Cross.From supplies to vehicles and relief workers, volunteers like Ellison are going to be boots on the ground in their response.\"Being able to hear their stories about what's happening. Was their home damaged? Was it destroyed? Why did they have to leave their home? To kind of comfort them, show compassion and empathy,\" Ellison said.He said no matter your age or ability, so long as you have a heart to help, there is something for you.\"There's so many different roles, whether it's helping with a blood draw, blood correction. Whether it's helping veterans, there's so many different avenues they can serve in, if they're more physically able and they wanna be involved with the disaster relief team,\" Ellison told KSL-TV.Four others from Utah will also be helping with boots on the ground following Hurricane Helene.Ellison said he hopes to help on other deployments following this one."}]
