[{"source": "ksl.com", "url": "https://www.ksl.com/article/51137911/retired-nfl-quarterback-brett-favre-says-he-has-parkinsons-disease", "title": "Retired NFL quarterback Brett Favre says he has Parkinson's disease", "author": "Mary Clare Jalonick, Associated Press", "date": "Sept. 24, 2024 at 2:34 p.m.", "content": "WASHINGTON — Retired NFL quarterback Brett Favre has been diagnosed with Parkinson's disease, he told a congressional committee Tuesday.Favre made the disclosure as part of his testimony about a welfare misspending scandal in Mississippi. Favre, who does not face criminal charges, has repaid just over $1 million in speaking fees funded by a welfare program in the state and was also an investor in a biotech company with ties to the case. The biotech firm has said it was developing concussion treatments.The former football star told the committee that he lost his investment in the company \"that I believed was developing a breakthrough concussion drug I thought would help others.\"\"As I'm sure you'll understand, while it's too late for me — I've recently been diagnosed with Parkinson's — this is also a cause dear to my heart,\" Favre said.What causes Parkinson's disease is unknown, and it is unclear if Favre's disease is connected to his football career or head injuries. He said in 2022 that he estimates he experienced \"thousands\" of concussions in his two decades in the NFL.Favre appeared at the Republican-led House Ways and Means Committee hearing to advocate reform of the federal welfare system to better prevent fraud.\"The challenges my family and I have faced over the last three years — because certain government officials in Mississippi failed to protect federal TANF (Temporary Assistance for Needy Families) funds from fraud and abuse, and are unjustifiably trying to blame me, those challenges have hurt my good name and are worse than anything I faced in football,\" Favre said.House Republicans have said a Mississippi welfare misspending scandal involving Favre and others points to the need for an overhaul in the federal program.Favre has said he didn't know the payments he received came from welfare funds and has noted his charity had provided millions of dollars to poor kids in his home state of Mississippi and in Wisconsin, where he played most of his career with the Green Bay Packers."}, {"source": "ksl.com", "url": "https://www.ksl.com/article/51137950/taylorsville-man-who-shot-killed-childhood-friend-during-fight-seeks-parole-", "title": "Taylorsville man who shot, killed childhood friend during fight seeks parole ", "author": "                                            Pat Reavy, KSL.com", "date": "Sept. 24, 2024 at 2:05 p.m.", "content": "SALT LAKE CITY — A Taylorsville man who shot and killed his childhood friend during a fight 11 years ago is now seeking parole.Prosecutors said Donald Orlando Valdez and David Gonzales, 28, were members of rival gangs when they got into a fight on Aug. 31, 2013, outside a party at 970 S. 300 West.During a hearing Tuesday before the Utah Board of Pardons and Parole, Valdez, now 42, said he and Gonzales were childhood friends and their two families have known each other even longer.That night, however, Valdez's brother, Nicholas James Valdez, got into a fistfight with Gonzales. Donald Valdez says when he saw this, he jumped in and ended up fighting with Gonzales himself. At some point during the fight, Gonzales started reaching for a gun in his waistband, which Valdez says he wrested away and picked up.\"As I got up, I turned around and fired a shot,\" he told the board.Gonzales was shot in the head and killed. Donald Valdez was charged with murder. In 2015 he pleaded guilty to a reduced charge of manslaughter, illegal discharge of a firearm and obstruction of justice, second-degree felonies. He was sentenced to three to 15 years in prison and two terms of one to 15 years in prison, and the three terms were ordered to be served consecutively.Because of state statute, however, consecutive sentences are limited to a maximum of 30 years. If Valdez serves his full time, he will be released in 2043. On Tuesday, he went before the Utah Board of Pardons and Parole for the first time.Valdez described being heavily involved in gangs at that time and how his \"reckless behavior,\" including drug use, led to a lot of \"poor choices.\"\"I had a pretty bad addiction to drugs and I was living a pretty reckless lifestyle,\" he said. \"I realize in my reckless behavior and my reckless lifestyle … it had me on a very vicious life cycle.\"Valdez says he didn't go to the party that night with the intention of hurting Gonzales and still doesn't understand how it got out of hand so quickly.\"I never intended for this situation to happen the way it did,\" he said.Rita Miera, Gonzales' mother, told the board she felt \"betrayed\" by Valdez. She, too, recalled how he and her son grew up together and how Valdez said Gonzales was like a little brother to him. As she addressed the board, he referred to Valdez simply as \"the inmate.\"\"I feel that he should do the full sentence,\" she said. \"Ten years is not long enough.\"When asked if he wanted to respond to Miera's comments, Valdez said, \"I want to apologize and say I'm sorry. That night, it got out of hand and there's no excuse for it. I made a poor choice.\"The board noted during the hearing that Valdez has had a clean record at the prison since 2018 and that his risk assessment score for reoffending had dropped substantially. Valdez attributes his change to the last time he was sent to maximum security at the prison and knew he \"had to make some pretty serious choices for myself.\"\"I knew I couldn't be traveling down this road anymore,\" he said. \"I decided to eliminate myself from a lot of past association with gangs.\"I understand his family may never be able to forgive me. But I am truly sorry for what I did,\" Valdez said.The five-member board will vote on whether to grant parole or set a date for another hearing. A decision is expected to take a couple of weeks."}, {"source": "ksl.com", "url": "https://www.ksl.com/article/51137976/harris-widens-lead-over-trump-blunts-his-economic-edge-poll-finds", "title": "Harris widens lead over Trump, blunts his economic edge, poll finds", "author": "Jason Lange, Reuters", "date": "Sept. 24, 2024 at 12:42 p.m.", "content": "WASHINGTON — Democratic Vice President Kamala Harris leads Republican Donald Trump 47% to 40% in the race to win the Nov. 5 U.S. presidential election, as she appeared to blunt Trump's edge on the economy and jobs, a Reuters/Ipsos poll published on Tuesday found.Harris had a six percentage point lead based on unrounded figures — which showed her with support from 46.61% of registered voters while Trump was backed by 40.48%, according to the three-day poll that closed on Monday. The Democrat's lead was slightly higher than her five-point advantage over Trump in a Sept 11-12 Reuters/Ipsos poll.The latest poll had a margin of error of about four percentage points.Asked which candidate had the better approach on the \"economy, unemployment and jobs,\" some 43% of voters in the poll picked Trump and 41% selected Harris. Trump's two-point advantage on the topic compares to his three-point lead in an August Reuters/Ipsos poll and an 11 point lead over Harris in late July shortly after she launched her campaign.While national surveys including Reuters/Ipsos polls give important signals on the views of the electorate, the state-by-state results of the Electoral College determine the winner, with seven battleground states likely to be decisive.The latest Reuters/Ipsos poll surveyed 1,029 U.S. adults online, nationwide, including 871 registered voters. Among these, 785 were considered the most likely to turn out on Election Day. Among these likely voters, Harris led 50% to 44%, though similar to her lead among all registered voters, her advantage was only five points when using unrounded figures."}, {"source": "ksl.com", "url": "https://www.ksl.com/article/51137744/new-judge-to-oversee-again-delayed-murder-trial-for-deaths-of-2-eagle-mountain-boys", "title": "New judge to oversee again-delayed murder trial for deaths of 2 Eagle Mountain boys", "author": "                                            Emily Ashcraft, KSL.com", "date": "Sept. 24, 2024 at 1:02 p.m.", "content": "PROVO — Kent Cody Barlow has a new attorney, and a new judge will be overseeing his murder trial now that the trial is delayed into next year — past the judge's retirement.The mothers of both toddlers killed when Barlow's car went off the road and crashed into Cedar Valley Stables in Eagle Mountain spoke at a hearing on Monday about how repeated delays in the case have been difficult for the family and have impacted their mental health and recovery — something the family brought up during previous hearings.Odin Jeffrey Ratliff and Hunter Charlie Jackson, both 3, were playing in a horse corral on May 2, 2022, when they were hit and killed by a car that left the road and veered into the stables. Three others who were in the car with Barlow testified that he was driving at a high rate of speed and ran a stop sign before the car hit a bump that sent it off the road and out of control.Brooke Jackson, Hunter's mother, said Monday it is \"ridiculous\" that they have been waiting for justice for 875 days, constantly rearranging schedules to attend many different court hearings.She said the case has become about the attorneys and \"how many tantrums can the defense attorneys get away with,\" rather than about Barlow and the victims. She said the attorneys keep saying they are not prepared for a trial and asked why they are still getting paid if they are not prepared.Barlow, 28, is charged with two counts of murder, a first-degree felony, and possession of a controlled substance, a class A misdemeanor. He is being represented by attorneys at the Utah County Public Defender's Association, who get paid through public funds.During Monday's hearing, Fourth District Judge Robert Lund spent almost a half hour talking about the case's history and why the trial was delayed even after he ruled multiple times that it would continue as scheduled this September.He said Barlow's previous attorney, Benjamin Aldana, continued filing motions until he withdrew from the case and never took leave due to his father's illness or death, saying what he had been told by Aldana's co-workers about the need for extended leave was misleading.Lund also said when the Utah Supreme Court granted Aldana's request to allow him to withdraw as Barlow's attorney — reversing Lund's ruling that he should stay and defend Barlow — the high court said its decision should not impact the trial dates. However, immediately after the ruling, Barlow's other attorney, Melissa Flowerday, argued that she would not be able to represent Barlow without Aldana. So, the trial was canceled.Related:Attorney withdraws, trial is delayed for man accused of killing 2 Eagle Mountain boysThe murder trial for Kent Cody Barlow was scheduled to begin Monday, but a judge agreed to postpone it Friday after the Utah Supreme Court allowed a defense attorney to withdraw.Aldana previously asked for Lund to be disqualified from the case, saying in May that his insistence on keeping the trial in September when Aldana claimed he could not be ready in time showed he was not impartial.Odin's mother, Theresa Ratliff, said she was ready to tell her story at the jury trial. She made arrangements to be gone from her job for three weeks, only to learn about the trial's cancellation two days before it was set to begin. She said she has been let down so many times and does not know when her heartbreak will end.She said while the defense attorneys are giving excuses about not being ready, the victims' plates are full, too — yet they make time for the case.\"I will fight for my son every day,\" Ratliff said.Barlow's new attorney, Justin Morrison, is now representing him alongside Flowerday. He said other cases he was assigned to earlier prevent him from being available for a trial in this case for the next six months.He said Monday, after the mothers spoke, that delays over the first nine months of the case should not be blamed on Barlow's attorneys because the prosecutors changed the charges from manslaughter to murder at that point.The judge told Morrison that he disagreed with that claim, saying the facts of the case did not change. During a trial, such details would only change the attorneys' closing arguments and not any testimony, he said.No hearings were set on Monday, Lund said he would talk to the presiding judge to learn which judge will be overseeing the case after this and encouraged the attorneys to talk to that judge quickly to schedule the trial.On Monday, deputy Utah County attorney Ryan McBride filed a motion asking the court to require the Utah County Public Defenders Association to appoint an attorney it contracts with, someone from outside its office, to represent Barlow. It is the third time prosecutors have made that request in this case, each time claiming the association is causing delays.He argued that the association either does not have the resources for the case or has chosen not to give the case the appropriate resources.McBride brought up the mothers' comments at the hearing and said the delays have led to \"significant health issues caused by the anxiety of the judicial process,\" reliving trauma at each hearing, and financial issues for the victims' families.He said the delay has significant costs. In addition to costs for the victims, who have a right to a speedy trial, he said a delay undermines the purpose of a trial to seek the truth as memories fade and the value of a conviction.McBride argued the office knew of Aldana's need for personal time 12 weeks before the trial, and that the court had ordered it to provide resources to the trial team.\"This cannot be allowed to happen again, and the best way to prevent it is to remove the (Utah County Public Defender's Association) from the case,\" McBride said."}, {"source": "ksl.com", "url": "https://www.ksl.com/article/51137975/pleasantly-surprised-utah-hc-fans-share-positive-vibes-despite-blocked-views-at-delta-center", "title": "'Pleasantly surprised': Utah HC fans share positive vibes despite blocked views at Delta Center", "author": "                                            Ryan Miller, KSL.com", "date": "Sept. 24, 2024 at 11:55 a.m.", "content": "SALT LAKE CITY — Ryan Smith climbed up the Delta Center's lower bowl stairs as the first fans trickled in on Monday.He greeted some early-comers with a wide smile and waved as shouts of \"Thank you, Ryan!\" echoed through the arena. As he got near the top, he turned to look at the ice.It was all real. Utah's very own NHL squad was about to take home ice for the first time.It's been a whirlwind five months for the new franchise. Utah HC has built a temporary practice facility and broke ground on a permanent one. It's designed jerseys, came up with a temporary brand and moved an entire organization north. It's put in an NHL-caliber locker room at the Delta Center and has begun planning renovations to fix the less-than-ideal sightlines.As Smith surveyed the arena — featuring wide black curtains draping large portions of the lower bowl and large swaths of seats that could only see one goal — his mind went to what it would look like in the future.\"We've got to get this fixed,\" he said.Steffaun Dandy was wide-eyed as he sat midway up the upper bowl behind one of the goals.The Utah Hockey Club had just made a grand introduction, scoring two first-period goals (with a couple of fights sandwiched in between) in rapid succession. A team deadset on making a good first impression delivered on all accounts.The one problem? Dandy and the rest of the fans sitting behind that net couldn't see either of those goals — at least not live. The view of the goal — and much of the attacking zone — was blocked by the steep wall of the arena. That is what Smith wants to fix with the renovations.The good news for Smith and Utah HC? The fans are willing to give the organization some grace.\"I mean, we've got a big screen to still see,\" Dandy said. \"It's better than watching at home and we get to watch it live a little bit. It's a budget seat; it's worth it. I'd rather be here than not.\"That was the sentiment for many fans who had single-goal viewing tickets on Monday. Of course, they would have preferred to see the entire ice, but being able to be in the arena and getting to bask in the atmosphere of NHL hockey still made for a memorable night.\"It's a good experience, and I feel like the team is feeding off the crowd,\" Aaron Feifer said. \"I'd like to see the whole thing, but it's cool.\"Even those that got some bad luck — all four regulation goals on Monday were scored on the same end — said they'd return for a game in the same section.\"Heck, I rarely can tell when the puck goes in anyway,\" Sam McCraig said with a laugh. \"It was just awesome to be here. I'd 100% come back.\"The organization has not yet determined what games will have single-goal tickets available, but a Smith Entertainment Group spokesperson said there is a good chance they will be offered for Friday and Saturday games. The other obstructed-view seats didn't come with any loud complaints either.\"The game moved so fast that I hardly noticed,\" said Kevin Adams, whose view had a corner of the ice blocked. \"I thought it was going to be more annoying. I was pleasantly surprised.\"Undoubtedly, the fans are in a bit of a honeymoon phase. It was the first preseason game for a team that arrived in what felt like a blink of an eye. So what's the plan for when the goodwill eventually wears off?Utah HC president Chris Armstrong said the team has explored the possibility of raising the floor to address the sightline issues, but no plans have been finalized.\"As you can understand and expect it's a complicated endeavor to do what we're trying to do in this building and still preserve the integrity of the fan experience for the Utah Jazz, but then ultimately create the best NHL hockey experience as well,\" he said. \"So I think we're going to take a very deliberate and meticulous and patient approach making sure that we do this the right way in the shortest amount of time.\"If Monday is an indication, the fans are fine being patient."}, {"source": "ksl.com", "url": "https://www.ksl.com/article/51137847/son-of-suspect-in-trump-assassination-attempt-arrested-on-child-sexual-abuse-images-charges", "title": "Son of suspect in Trump assassination attempt arrested on child sexual abuse images charges", "author": "Alanna Durkin Richer, Associated Press", "date": "Sept. 24, 2024 at 11:30 a.m.", "content": "WASHINGTON — The son of the man suspected in the assassination attempt in Florida against former President Donald Trump has been arrested on federal charges of possessing child sexual abuse images.Oran Alexander Routh was arrested this week after authorities searched his Greensboro, North Carolina, home \"in connection with an investigation unrelated to child exploitation,\" and found hundreds of files depicting child sexual abuse, an FBI agent said in court papers.Investigators who seized multiple electronic devices found videos sent to Oran Routh in July as well as chats from a messaging application commonly used by people who share child sexual abuse material, the FBI agent said.He faces two charges of possessing and receiving child sexual abuse material and is expected to appear later Tuesday in federal court in North Carolina.There was no attorney listed for Oran Routh in court papers. Phone messages left for relatives of Oran Routh were not immediately returned.Oran Routh's father, Ryan Wesley Routh, has been charged with federal gun offenses in connection to the attempted assassination at Trump's Florida golf course earlier this month. Prosecutors have indicated much more serious attempted assassination charges are coming.Oran Routh's arrest was first reported Tuesday by ABC News.A federal judge on Monday agreed with Justice Department prosecutors that Ryan Routh should remain locked up while he awaits trial in his case.Prosecutors have said Ryan Routh left behind a note detailing his plans to kill the former president and kept in his car a handwritten list of dates and venues where Trump was to appear. The note describing Routh's plans was placed in a box that he dropped off months earlier at the home of an unidentified person who did not open it until after Ryan Routh's arrest, prosecutors said.Ryan Routh is currently charged with illegally possessing his gun in spite of multiple felony convictions, including two charges of possessing stolen goods in 2002 in North Carolina, and with possessing a firearm with an obliterated serial number.But a prosecutor said in court Monday that they would pursue additional charges before a grand jury, accusing him of having tried to \"assassinate a major political candidate\" — charges that would warrant life in prison in the event of a conviction.It is common for prosecutors to file more easily provable charges as an immediate placeholder before adding more significant allegations as the case proceeds.Ryan Routh was arrested Sept. 15 after a Secret Service agent who was scoping the Trump International Golf Club for potential security threats saw a partially obscured man's face and the barrel of a semiautomatic rifle, aimed directly at the former president.The agent fired at Routh, who sped away before being stopped by officials in a neighboring county, leaving behind a loaded rifle, digital camera, a backpack and a reusable shopping bag that was hanging from a chain-link fence."}, {"source": "ksl.com", "url": "https://www.ksl.com/article/51136863/young-and-diverse-a-look-into-the-second-largest-racial-ethnic-group-in-utah-", "title": "'Young and diverse': A look into the second largest racial, ethnic group in Utah ", "author": "Caitlin Keith, Deseret News", "date": "Sept. 24, 2024 at 11:12 a.m.", "content": "SALT LAKE CITY — As National Hispanic Heritage Month has begun in Utah and around the country, a look at the Latino and Hispanic population shows a young and vibrant group — and perhaps more diverse than meets the eye.The University of Utah's Kem C. Gardner Policy Institute recently released a fact sheet, \"Exploring Utah's Hispanic or Latino Groups: A Detailed Analysis.\" This analysis looked into the size, growth, age and specific demographics of the Latino and Hispanic population of Utah, finding that this population is younger than the rest of Utah.Heidi Prior, a public policy analyst at the institute, was the primary author of the fact sheet. The information in the analysis came from the 2020 U.S. Census.\"The largest purpose is just to provide a really thorough, in-depth look at Utah's Hispanic and Latino population,\" Prior said. \"We have half a million Hispanic and Latino residents in the state. That's 15% of our population. So it's a really huge group of people that merits some attention and some research.\"Utah's Latino and Hispanic population is the second largest racial or ethnic group in the state.\"So when I think about the Hispanic population, I think of this fast-growing group that's very diverse, coming from lots of different ethnic origins and countries,\" Prior said. \"I also think of a very young population.\"Prior emphasized the fact that Utah's Hispanic and Latino population is so young. According to the fact sheet, Utah's median age is 31.3 years, while the median age of Utah's Hispanic population is 25.4 years.Fewer than 1 in 20 Hispanic Utahns are age 65 or older, but more than 1 in 8 non-Hispanic Utahns are over 65.Youth under the age of 18 make up 35.8% of Utah's Hispanic population, while only 27.8% of Utah's non-Hispanic population are under 18.\"We have a young population to begin with, and then our Hispanic population is even younger,\" Prior said.What else does the fact sheet tell us about Utah's Hispanic population?The Hispanic population within Utah also made up a major portion of the state's population growth between 2010 and 2020, with 1 in 4 of new Utah residents identifying as Hispanic or Latino.Specific cities in Utah gained more Hispanic residents in this 10-year period than the rest of the state. Those three cities are West Valley City, West Jordan and Herriman.In the analysis, Prior also looked at the Hispanic populations in each of Utah's counties, finding that this population is concentrated along the Wasatch Front. More than 8 in 10 of Utah's Hispanics live in either Weber, Davis, Salt Lake or Utah counties. The majority of Utahns in general live in these counties, with 75.5% of the state's population there.In the 2020 census, a new feature was added to the questionnaire. In the race portion of the survey, there was a fill-in-the-blank option, which allowed people to be more specific in their race identity.\"So if you were Hispanic or Latino, you could check a box indicating that you identified as Hispanic or Latino, but then you could also write in how you identified in a more detailed way, like, 'I'm Venezuelan, I'm Spanish, I'm Mexican, and Chilean,'\" Prior said. \"As a demographer, it was really exciting to get that detailed data about how people self identify.\"Young mariachi performers watch during Sones de Mariachi en Utah, a mariachi competition in connection with Hispanic Heritage Month 2023 at the Capitol in Salt Lake City on Aug. 30, 2023. (Photo: Scott G Winterton, Deseret News)This detailed information was released by the Census Bureau about a year ago.Thanks to this new detailed data, the Gardner Institute was able to do a more in-depth and detailed analysis into Utah's Hispanic population than was possible before.According to the fact sheet, \"Hispanic or Latino Utahns belong to four regional groups and identify as 30 different detailed origins, including Mexican, Dominican, and Chilean.\"One in 10 Utahns identify as Mexican, making up two-thirds of Utah's Hispanic or Latino Population. According to Prior, this isn't surprising since Utah is in the Southwest, but it is different than the demographics found on the East Coast.Utah's Hispanics most commonly identify as Mexican (326,430), Spaniard (14,489), Salvadoran (14,426), Peruvian (12,488) or Spanish (11,981).The largest share of Chilean residents in the U.S. is in Utah, with 0.2% of Utahns identifying as Chilean. Utah also has the country's second largest share of Argentine and Venezuelan residents.Utah's Venezuelan population is the state's fastest growing Hispanic group, having almost quadrupled between 2010 and 2020.National Hispanic Heritage Month in UtahNational Hispanic Heritage Month is currently underway. It started on Sept. 15 and goes until Oct. 15.\"It's important for this data to be out there all the time,\" Prior said. \"But Hispanic Heritage Month is a great event to remind us about this part of our population And the contribution that they make.\"According to KSL.com, the timing of Hispanic Heritage Month lines up with the independence anniversaries of several countries, Sept. 15 in Costa Rica, El Salvador, Guatemala, Honduras and Nicaragua; Sept. 16 in Mexico; and Sept. 18 in Chile.There are a variety of events in Utah celebrating Hispanic Heritage Month, and a few of them have already happened such as The Utah Central American Festival, a Latino Festival in Logan and a celebration to mark the 214th anniversary of Mexico's independence hosted by the Mexican Consulate of Utah.One of the upcoming Hispanic Heritage Events in Utah is a Latino and Hispanic Heritage event on Sept. 23 in North Salt Lake, per KSL.com.The Utah Symphony is also putting on a Celebración Sinfónica event at Abavanel Hall on Sept. 27-28."}, {"source": "ksl.com", "url": "https://www.ksl.com/article/51137853/patrick-kinahan-familiar-names-top-big-12-power-poll", "title": "Patrick Kinahan: Familiar names top Big 12 power poll", "author": "                                            Patrick Kinahan for KSL.com", "date": "Sept. 24, 2024 at 10:32 a.m.", "content": "SALT LAKE CITY — Thankfully done with the preliminaries, which often border on glorified scrimmages based on wildly inferior competition, conference play has begun in earnest around the country in college football.All those earlier power polls mostly are projections, combining last season's results with the number of returning starters for the respective teams. But now there's ample evidence, which will continue to pile up as the heart of the season commences.With that, let's rank Big 12 teams and where each stand now that autumn has officially closed in. And how about this, the top two teams are separated by 45 miles and not much else.1. UtahThe preseason favorite in their inaugural Big 12 season, the Utes have a cushy path to the conference championship game in Texas on Dec. 7. Schedule makers did their part, lightening the load with teams competing for the middle of the conference.The Utes also took a gigantic step toward Arlington by dominating — excluding late in the fourth quarter — Oklahoma State in Stillwater. And they did it with first-year freshman Isaac Wilson at quarterback, which leads to the only serious question surrounding the team. Wilson is 2-0 as a starter in relief of oft-injured Cam Rising, who has played a mere four quarters of football in Utah's last 17 games.2. BYUEasily the surprise team so far, the Cougars may have had the shocker of the season in crushing nationally-ranked Kansas State at home on Saturday. The Wildcats, who blew out Big 12 member Arizona at home two weeks ago in a designated nonconference game, looked out of sorts against BYU despite owning statistical advantages in multiple categories.The truth about the Cougars: The defense is awesome, and the offense is opportunistic with a chance to develop.3. Iowa StateTwo gimmes (North Dakota and Arkansas State) ensured a decent start to the season, but the eye-opener came in the thrilling 1-point win at Iowa. Wide receiver Jayden Higgins has caught a touchdown pass in each of his last five games.4. UCFIt's time to consider the Knights, who play host to BYU next month and Utah in the last regular-season game this season, as a legitimate contender. Led by RJ Harvey, who has rushed for 448 yards, they have three running backs averaging at least 6.6 yards per carry, and the team leads the nation in rushing at 375.7 yards a game.5. Oklahoma StateMike Gundy's team deserves some respect — for now — but the offense needs substantial improvement or else championship aspirations slip away. Then again, maybe Utah's defense is just that good.6. Kansas StateIt will be interesting to see how the Wildcats respond after the head-scratching loss. With Oklahoma State up this week, it's crazy to think one of the top three preseason contenders will fall to 0-2 in the conference.7. Texas TechThe typically potent offense had the type of balance in the win over Arizona State that makes it hard to defend. Behren Morton passed for two touchdowns and 201 yards, and Tahj Brooks rushed for 117 yards.8. CincinnatiOnly a 1-point loss separates the Bearcats from being undefeated, but the three wins are against weak competition.9. ColoradoA miracle finish in the win over Baylor breathed life into this overhyped program.10. Arizona StateThe Sun Devils already have matched the win total for each of the previous two seasons. A 3-0 start was padded by beating Wyoming (0-4) and Mississippi State (1-3).11. ArizonaWith plenty of time to change course, the Wildcats are tied with Kansas as the conference's most disappointing team. Harder-than-expected wins over New Mexico and Northern Arizona preceded an embarrassing loss to Kansas State.12. BaylorEpic collapse against Colorado plants more seeds of doubt.13. West VirginiaWin one, lose one is the pattern so far going into a bye week.14. KansasViewed as a contender, the Jayhawks have lost three consecutive games and haven't beat an FBS team.15. TCUTwo-game losing streak for the Horned Frogs sets up a battle of desperate teams this week against Kansas.16. HoustonA 4-point loss to Oklahoma and win over Rice injected a dose of optimism into the program, but a 34-0 loss at Cincinnati brought it back down to earth. Bowl eligibility appears a longshot."}, {"source": "ksl.com", "url": "https://www.ksl.com/article/51137079/severe-obesity-is-on-the-rise-in-the-us", "title": "Severe obesity is on the rise in the US", "author": "Jonel Aleccia, Associated Press", "date": "Sept. 24, 2024 at 9:33 a.m.", "content": "WASHINGTON — Obesity is high and holding steady in the U.S., but the proportion of those with severe obesity — especially women — has climbed since a decade ago, according to new government research.The U.S. obesity rate is about 40%, according to a 2021-2023 survey of about 6,000 people. Nearly 1 in 10 of those surveyed reported severe obesity, the U.S. Centers for Disease Control and Prevention found. Women were nearly twice as likely as men to report severe obesity.The overall obesity rate appeared to tick down vs. the 2017-2020 survey, but the change wasn't considered statistically significant; the numbers are small enough that there's mathematical chance they didn't truly decline.That means it's too soon to know whether new treatments for obesity, including blockbuster weight-loss drugs such as Wegovy and Zepbound, can help ease the epidemic of the chronic disease linked to a host of health problems, according to Dr. Samuel Emmerich, the CDC public health officer who led the latest study.\"We simply can't see down to that detailed level to prescription medication use and compare that to changes in obesity prevalence,\" Emmerich said. \"Hopefully that is something we can see in the future.\"Most telling though, the results that show that the overall obesity rate in the U.S. has not changed significantly in a decade, even as the rate of severe obesity climbed from nearly 8% in the 2013-2014 survey to nearly 10% in the most recent one. Before that, obesity had increased rapidly in the U.S. since the 1990s, federal surveys showed.Measures of obesity and severe obesity are determined according to body mass index, a calculation based on height and weight. People with a BMI of 30 are considered to have obesity; those with a BMI of 40 or higher have severe obesity. BMI is regarded as a flawed tool but remains widely used by doctors to screen for obesity.\"Seeing increases in severe obesity is even more alarming because that's the level of obesity that's most highly associated with some of the highest levels of cardiovascular disease and diabetes and lower quality of life,\" said Solveig Cunningham, an Emory University global health professor who specializes in obesity.Cunningham, who was not involved in the new study, said it's not clear why rates of severe obesity are going up, or why they were higher among women. Factors could include the effects of hormones, the impact of childbearing or other causes that require further study, she said.The new study also found that obesity rates varied by education. Almost 32% of people with a bachelor's degree or higher reported having obesity, compared with about 45% of those with some college or a high school diploma or less.The new report follows the release earlier this month of data from U.S. states and territories that showed that in 2023, the rate of obesity ranged widely by place, from a high of more than 41% of adults in West Virginia to a low of less than 24% of adults in Washington, D.C. Rates were highest in the Midwest and the South.All U.S. states and territories posted obesity rates higher than 20%. In 23 states, more than 1 in 3 adults had obesity, the data showed. Before 2013, no state had a rate that high, said Dr. Alyson Goodman, who leads a CDC team focused on population health. Photo: CDCColor-coded U.S. maps tracking the change have gradually shifted from green and yellow, the hues associated with lower obesity rates, to orange and dark red, linked to higher prevalence.\"Sometimes, when you look at all that red, it's really discouraging,\" Goodman said.But, she added, recent emphasis on understanding obesity as a metabolic disease and new interventions, such as the new class of weight-loss drugs, gives her hope.The key is preventing obesity in the first place, starting in early childhood, Cunningham said. Even when people develop obesity, preventing additional weight gain should be the goal.\"It's really hard to get obesity to reverse at the individual level and at the population level,\" Cunningham said. \"I guess it's not surprising that we're not seeing downward shifts in the prevalence of obesity.\""}, {"source": "ksl.com", "url": "https://www.ksl.com/article/51137707/-man-on-atv-killed-trying-to-cross-road-in-box-elder-county", "title": " Man on ATV killed trying to cross road in Box Elder County", "author": "                                            Collin Leonard, KSL.com", "date": "Sept. 24, 2024 at 9:11 a.m.", "content": "THATCHER, Box Elder County — A man driving an all-terrain vehicle was killed Monday trying to cross state Route 102, according to the Utah Highway Patrol.The driver was heading down a dirt road that crosses the two-lane highway into the parking lot of a Latter-day Saint meetinghouse, but \"failed to yield the right of way\" to a Chevy truck pulling a flatbed trailer going west, the UHP said.He tried to cross the road \"at a high rate of speed\" but collided with the right rear tire of the Chevy, throwing him from the ATV, according to troopers. The Chevy jackknifed and stopped in the road, blocking traffic.The man, who has not been identified, died at the scene. The driver and passenger of the Chevy were not injured.This story will be updated."}, {"source": "ksl.com", "url": "https://www.ksl.com/article/51137698/utah-man-with-history-of-throwing-rocks-at-police-arrested-again-", "title": "Utah man with history of throwing rocks at police arrested, again ", "author": "                                            Pat Reavy, KSL.com", "date": "Sept. 24, 2024 at 8:42 a.m.", "content": "SANDY — A Utah man with a history of throwing rocks at cars and business windows was arrested again Monday after police say he threw rocks at a Utah Transit Authority police vehicle while the officer was sitting in his car.Khaled Saleh Jeddou, 40, was arrested for investigation of assault on an officer.A UTA police officer was sitting in his patrol truck while typing on his laptop in the parking lot of the TRAX Historic Sandy Station, 165 E. 9000 South, when Jeddou \"walked up to the passenger side of the vehicle and threw a large softball-sized rock at the window. The impact broke the passenger front window and I was sprayed by glass from the impact,\" the officer wrote in a police booking affidavit.The officer got out of his car to confront Jeddou, who then threw a second rock, \"smashing the rear tail light on the cab of my patrol vehicle,\" the affidavit states.At that point, Jeddou obeyed the officer's commands to get on the ground and was arrested.Monday's arrest comes just four days after Jeddou was released from the Salt Lake County Jail where he was serving time for throwing rocks at another officer at another TRAX station, according to court records.In that case, on March 28, Jeddou threw rocks at UTA employees and an officer at the Draper Town Center Station, 1131 E. Pioneer Road. He was charged in 3rd District Court with two counts of assault on an officer, a class A misdemeanor; and five counts of assault and property damage, class B misdemeanors. In May, Jeddou was convicted of one count of assault on an officer and one count of assault and was sentenced to time already served, according to court records.In June, an arrest warrant was issued for violating the conditions of his probation in that case and he was rebooked into jail on Sept. 5.Jeddou was also charged in February 2022 with two counts of criminal mischief, a third-degree felony and a class B misdemeanor, for throwing multiple rocks at the front sliding glass door of the Larry H. Miller building at 9350 S. 150 East, according to charging documents. After damaging the doors, police say Jeddou smashed the front windshield of a car in the parking lot.That case was eventually dismissed after Jeddou was determined to be incompetent to stand trial, according to court records.Jeddou's arrest at the Larry H. Miller building came just a week after he was arrested for \"throwing several large rocks\" at two UTA police patrol vehicles at 140 W. Vine Street. He threw at least nine rocks at two vehicles, the charges state. Jeddou was charged with criminal mischief, a second-degree felony, in that case, which was also later dismissed when he was determined to be incompetent to stand trial."}, {"source": "ksl.com", "url": "https://www.ksl.com/article/51137112/utah-family-fears-for-safety-of-loved-ones-in-lebanon", "title": "Utah family fears for safety of loved ones in Lebanon", "author": "Garna Mejia, KSL-TV", "date": "Sept. 24, 2024 at 8:19 a.m.", "content": "SALT LAKE CITY — When you step into the Beirut Café, you're transported to Fatima Soweidan's home in southern Lebanon. On Monday, as customers enjoyed family recipes, Fatima's thoughts were with her loved ones half a world away.\"It's all over the news. Everybody is seeing what is going on,\" Soweidan said. \"I have a sister there with her kids and her husband. All my friends, all my cousins, everybody is there so they are separated right now. They don't know where to go. They're just trying to hide themselves, trying to save themselves.\"Fatima Soweidan works at the Beirut Café in Salt Lake City on Monday. She's concerned about the safety of loved ones in Lebanon. (Photo: Jackson Grimm, KSL-TV)On Monday, the Israeli military launched another attack in their conflict against Hezbollah. Israeli airstrikes killed almost 560 people, including women and children, and left more than 1,600 wounded.\"I just heard like, right now, one of our cousins, (and) 25 (people in my town) died. Just one bomb it ... it killed them all,\" Soweidan said. \"One of them was pregnant. She's 20 years old. Not everyone from Lebanon is (part of) Hezbollah.\"Soweidan shared a picture of her cousins in Lebanon. They are believed to be among the dead. Amid international fears of a regional escalation and a wider war, Soweidan prays for peace.Fatima Soweidan’s cousins who were in Lebanon when the attacks happened on Monday. Nearly 560 people died. (Photo: Fatima Soweidan)\"I'm not going to say I'm afraid. I'm going to say it's not fair for innocent people to get killed like that,\" she said. \"We can't kill each other.\"Soweidan said that communication lines are down, so information is trickling in slowly."}, {"source": "ksl.com", "url": "https://www.ksl.com/article/51136983/she-was-amazing-family-identifies-driver-killed-in-tooele-county-rollover-crash", "title": "'She was amazing': Family identifies driver killed in Tooele County rollover crash", "author": "Brianna Chavez, KSL-TV", "date": "Sept. 24, 2024 at 8:02 a.m.", "content": "TOOELE — The family of a woman killed in a rollover crash in Tooele County has identified her as Denice Willden, 34.\"Growing up, we were together a lot,\" said her older sister, Amie Carley. They were always together, even as adults, Carley said, so much so they even worked together.\"On one of my worst days, she could have been right there and put a smile on my face,\" Carley said. \"She was just the best.\"Last Monday, Willden hadn't been heard from all day. Carley said her boss had asked if she could get ahold of her. The Tooele County Sheriff's Office received a call about a single-vehicle rollover crash on Mormon Trail Road near Rush Valley.\"(Her boyfriend) had (seen) that on the news that there was an accident,\" Carley said. \"(He) drove down to the scene to see if it was her.\"Deputies confirmed Willden, who was the only person involved in the crash, had died. She leaves behind two children, ages 3 and 15.\"She's a good mother. She'd do anything for her kids, anything for her family. She was helpful, thoughtful. she's an amazing girl,\" Carley said.A GoFundMe* page was created to help her children as they grieve their mother's loss.The Tooele County Sheriff's Office told KSL-TV they are continuing to investigate the crash, but Carley believes her sister may have been driving distracted. She's asking other drivers to be cautious.\"Don't take your family for granted. Don't take your friends for granted. And while you're driving, just pay attention to what you're doing,\" Carley said.*KSL.com does not assure that the money deposited to the account will be applied for the benefit of the persons named as beneficiaries. If you are considering a deposit to the account, you should consult your own advisers and otherwise proceed at your own risk."}, {"source": "ksl.com", "url": "https://www.ksl.com/article/51136760/what-the-ioc-leader-whos-coming-to-utah-this-week-told-the-united-nations-about-the-olympics", "title": "What the IOC leader who's coming to Utah this week told the United Nations about the Olympics", "author": "Lisa Riley Roche, Deseret News", "date": "Sept. 24, 2024 at 7:42 a.m.", "content": "SALT LAKE CITY — International Olympic Committee President Thomas Bach held up the 2024 Summer Games in Paris as an example of sport's contributions to the United Nations' mission of advancing peace and prosperity during a speech at the agency's New York City headquarters.Bach, who is scheduled to be in Utah Friday and Saturday to tour 2034 Winter Games venues as part of his visit to the United States, spoke Sunday after U.N. members adopted a blueprint for taking on a long list of global challenges, including climate change, escalating conflicts, AI and responding to \"complex shocks\" such as pandemics, according to The Associated Press.The IOC leader, whose final term as president ends next year, praised the U.N. General Assembly's support for the \"Pact for the Future\" that contained several references to sport, including a commitment to \"invest in accessible, safe, inclusive and equitable quality education for all, including physical education and sport.\"Bach focused on peace as the \"most fundamental\" goal, saying the IOC was proud of being able to bring together athletes from 206 countries with national Olympic committees as well as the largest-ever refugee team to compete in Paris. Athletes from Russia and Belarus, however, had to compete under a neutral status due to the ongoing attack against Ukraine.Despite fierce competition during the Summer Games, Bach said the athletes \"live peacefully together under one roof in the Olympic Village\" and \"respected each other, with no incident or discrimination whatsoever — even if their countries are at war,\" modeling what he called a culture of peace.Other Paris 2024 highlights cited in the IOC president's speech:It was the first Games with full gender parity.Carbon emissions were reduced by half compared to previous Olympics.IOC Refugee Olympic team competed with 37 athletes from 11 nations including Afghanistan and won its first-ever medal.From New York City, Bach is scheduled to make a stop at the Colorado Springs headquarters of the U.S. Olympic and Paralympic Committee. He'll head Friday to Salt Lake City, where he'll tour venues from the 2002 Winter Games that are set to be used again and meet with local and state leaders, including the donors who funded Utah's bid.Once a site has been selected for a future Games, the IOC president regularly visits the host soon after, according to a spokesman. IOC members voted to award the 2034 Winter Games to Utah in Paris on July 24. This will be Bach's first trip to the state since the 2002 Winter Games. He is also expected to spend time in Los Angeles, site of the 2028 Summer Games, before leaving the U.S."}, {"source": "ksl.com", "url": "https://www.ksl.com/article/51136882/when-life-gives-you-bananas-st-george-couple-turned-prank-into-a-6-figure-business", "title": "'When life gives you bananas': St. George couple turned prank into a 6-figure business", "author": "Jessi Bang, St. George News", "date": "Sept. 24, 2024 at 7:21 a.m.", "content": "ST. GEORGE — What started as a cheeky banana prank quickly baked into something bigger — now it's a full-fledged bread business bringing in the dough.\"It's been a weird, the most out-there thing that we would have never expected,\" Kate's Banana Bread co-owner Brock Guthrie said.Guthrie and his wife, Kate Guthrie, are the dynamic duo behind Kate's Banana Bread, a homemade banana bread business that began as an unexpected fluke. Just before their son Finn was born last May, the couple took a leap of faith and quit their jobs to prioritize spending time together. Brock Guthrie had been working for a well-known YouTuber while his wife was building a career in web development.Knowing it would take time for their new venture to gain traction, they turned to working for DoorDash to keep things afloat after burning through their savings. One day, they stopped at the mall to change their baby's diaper and take a breather. When they returned to their car, they were shocked to find a friend had covered it in over 100 bananas. Confused and amused, they decided to do something about it.Read the entire story at St. George News."}, {"source": "ksl.com", "url": "https://www.ksl.com/article/51137247/israel-and-hezbollah-renew-fire-after-the-deadliest-day-in-lebanon-since-2006", "title": "Israel and Hezbollah renew fire after the deadliest day in Lebanon since 2006", "author": "Abby Sewell, Associated Press", "date": "Sept. 24, 2024 at 7:00 a.m.", "content": "BEIRUT — Israel and Hezbollah traded fire again on Tuesday — including a new Israeli airstrike on Beirut — as the death toll from a massive Israeli bombardment climbed to nearly 560 people and thousands fled from southern Lebanon with the two sides on the brink of all-out war.Displaced families slept in shelters hastily set up in schools in Beirut and the coastal city of Sidon. With hotels quickly booked to capacity or rooms priced beyond the means of many families, those who did not find shelter slept in their cars, in parks or along the seaside.Issa Baydoun fled the village of Shihine in southern Lebanon when it came under bombing and came to Beirut in a convoy of cars with his extended family. They slept in the vehicles on the side of the road after discovering that the shelters were full.\"We struggled a lot on the road just to get here,\" he said. Baydoun rejected Israel's contention that it hit only military targets.\"We evacuated our homes because Israel is targeting civilians and attacking them,\" he said. \"That's why we left our homes, to protect our children.\"Well-wishers offered up empty apartments or rooms in their houses in social media posts, while volunteers set up a kitchen at an empty gas station in Beirut, which first became a hub for volunteers after the devastating 2020 Beirut port explosion, to cook meals for the displaced.In the eastern city of Baalbek, the state-run National News Agency reported that lines formed at bakeries and gas stations as residents rushed to stock up on essential supplies in anticipation of another round of strikes on Tuesday.Meanwhile, the border crossing with Syria saw massive traffic jams as a result of people escaping from Lebanon to the neighboring country.The Lebanese militant group Hezbollah said it launched missiles overnight and in the morning at eight sites in Israel, including an explosives factory in Zichron, 37 miles from the border.Cars sit in traffic as they flee the southern villages amid ongoing Israeli airstrikes, in Sidon, Lebanon, Monday. (Photo: Mohammed Zaatari, Associated Press)The Israeli military said Tuesday morning that 55 rockets were fired from Lebanon into northern Israel, setting fires and damaging buildings. Military officials said they carried out dozens of airstrikes on Hezbollah targets, including on a cell that fired rockets overnight, and that tanks and artillery struck targets near the border.An Israeli airstrike hit a building in a southern suburb of Beirut on Tuesday afternoon, a Hezbollah-run television station reported, with no immediate word on casualtiesGalilee Medical Center, a northern Israel hospital, said that two patients arrived with minor head injuries from a rocket falling near their car. Several others were being treated for light wounds from running to shelters and traffic accidents when alarms sounded.The renewed exchange came after Monday's barrages racked up the highest death toll in any single day in Lebanon since Israel and Hezbollah fought a bruising monthlong war in 2006.Israel said it targeted sites where Hezbollah had stored weapons. Data from American fire-tracking satellites analyzed Tuesday by the Associated Press showed the wide range of Israeli airstrikes aimed at southern Lebanon, covering an area of over 650 square miles.NASA's Fire Information for Resource Management System typically is used to track wildfires across rural areas of the U.S. However, it can also be used to track the flashes and burning that follow airstrikes. That's particularly true when an airstrike ignites flammable material on the ground, such as munitions or fuel.Israeli Iron Dome air defense system fires to intercept rockets that were launched from Lebanon, as seen from Haifa, northern Israel, Monday. (Photo: Baz Ratner, Associated Press)Data from Monday showed significant fires breaking out across southern Lebanon and in the Bekaa Valley. Several areas showed intense, multiple fires, including near the southern coastal town of Naqoura, which hosts a base for the U.N. peacekeeping mission in southern Lebanon known as UNIFIL. Others were in mountainous rural areas or villages.The sides appear on the verge of war again after tensions have steadily escalated over the last 11 months. Hezbollah has been firing rockets, missiles and drones into northern Israel in solidarity with the Palestinians and its ally Hamas, a fellow Iran-backed militant group, in Gaza.Hezbollah is the strongest political and military actor in Lebanon and widely considered the top paramilitary force in the Arab world.Israel has responded with increasingly heavy airstrikes and the targeted killing of Hezbollah commanders while threatening a wider operation.Thousands of Lebanese fled the southern part of the country on Monday after the Israeli military ordered people to evacuate areas where it accuses Hezbollah of positioning rocket launchers and other weapons, in the biggest exodus since the monthlong war waged 18 years ago.The Lebanese Health Ministry said the strikes since Monday killed at least 558 people, including 50 children and 94 women, and wounded more than 1,800 people — a staggering one-day toll for a country still reeling from a deadly attack on communication devices last week.Nearly a year of cross-border fire had already emptied out communities near the border, displacing tens of thousands of people on both sides. Israel has vowed to do whatever it takes to ensure its citizens can return to their homes in the north, while Hezbollah has said it will keep up its rocket attacks until there is a cease-fire in Gaza, which appears increasingly remote.Contributing: Jon Gambrell, Bassem Mroue, Fadi Tawil, Julia Frankel"}, {"source": "ksl.com", "url": "https://www.ksl.com/article/51136759/utah-teen-hits-the-movies-with-friends-in-heartwarming-tiktok-moving-millions", "title": "Utah teen hits the movies with friends in heartwarming TikTok, moving millions", "author": "Tamara Vaifanua, KSL-TV", "date": "Sept. 24, 2024 at 6:15 a.m.", "content": "SALT LAKE CITY — Kimberly Dowdell's 13-year-old son, Jack, made a positive impression in a big way this year. Jack has Down syndrome, and through it, he's reminding millions of people what true friendship looks like.Dowdell shared a video on TikTok — a sweet moment of Jack waiting for friends to pick him up for the movies.These kids are Jack's peer tutors at South Jordan Middle School. They asked his mom for permission to take Jack to the movies.\"Probably like every hour he was asking 'When (is) the movies, mom? When (is) the movies? When am I going to the movies?'\" Dowdell said.She said she's grateful his friends see him as an individual and look beyond his disabilities. So far, the video has over a million likes.\"I had no idea that when I shared this video it would touch so many hearts as it did,\" she said. \"There's so many people who, gosh I'm going to get emotional, they're so many people who want this for their children.\"Dowdell said she hopes Jack's experience gives other families hope that everything will be OK, and ultimately, their kids have so much potential.Contributing: Mary Culbertson"}]
